Repository: Wang-Yan-Hao/FreeBSD-Online-Document-Editor
Catalog: documentation/content/*/articles/cups/_index.po
Languages: es

source: How to install and use CUPS on FreeBSD
es: Cómo instalar y usar CUPS en FreeBSD

source: CUPS on FreeBSD
es: CUPS en FreeBSD

source: Abstract
es: Resumen

source: An article about configuring CUPS on FreeBSD.
es: Un artículo sobre la configuración de CUPS en FreeBSD.

source: An Introduction to the Common Unix Printing System (CUPS)
es: Una introducción al sistema de impresión común de Unix (CUPS)

source: CUPS, the Common UNIX Printing System, provides a portable printing layer for UNIX(R)-based operating systems. It has been developed by Easy Software Products to promote a standard printing solution for all UNIX(R) vendors and users.
es: CUPS, Common UNIX Printing System, proporciona una capa portable de impresión para sistemas operativos basados en UNIX(R). Ha sido desarrollado por Easy Software Products para promover una solución de impresión estándar para todos los fabricantes y usuarios de UNIX(R).

source: CUPS uses the Internet Printing Protocol (IPP) as the basis for managing print jobs and queues. The Line Printer Daemon (LPD), Server Message Block (SMB), and AppSocket (aka JetDirect) protocols are also supported with reduced functionality. CUPS adds network printer browsing and PostScript Printer Description (PPD) based printing options to support real-world printing under UNIX(R). As a result, CUPS is ideally-suited for sharing and accessing printers in mixed environments of FreeBSD, Linux(R), Mac OS(R) X, or Windows(R).
es: CUPS utiliza el Internet Printing Protocol (IPP) como base para gestionar trabajos de impresión y colas. Los protocolos Line Printer Daemon (LPD), Server Message Block (SMB) y AppSocket (también conocido como JetDirect) también están soportados con funcionalidad reducida. CUPS añade navegación de impresoras de red y opciones de impresión basadas en PostScript Printer Description (PPD) para soportar impresión en el mundo real bajo UNIX(R). Como resultado, CUPS encaja perfectamente para compartir y acceder a impresoras en entornos mixtos de FreeBSD, Linux(R), Mac OS(R) o Windows(R).

source: The main site for CUPS is http://www.cups.org/[http://www.cups.org/].
es: El sitio principal para CUPS es http://www.cups.org/[http://www.cups.org/].

source: Installing the CUPS Print Server
es: Instalación del servidor de impresión CUPS

source: To install CUPS using a precompiled binary, issue the following command from a root terminal:
es: Para instalar CUPS utilizando un binario precompilado, ejecuta el siguiente comando desde un terminal root:

source: Other optional, but recommended, packages are package:print/gutenprint[] and package:print/hplip[], both of which add drivers and utilities for a variety of printers. Once installed, the CUPS configuration files can be found in the directory [.filename]#/usr/local/etc/cups#.
es: Otros paquetes opcionales, pero recomendados, son package:print/gutenprint[] y package:print/hplip[] que añaden controladores y utilidades para varias impresoras. Una vez instalado, los ficheros de configuración de CUPS se pueden encontrar en el directorio [.filename]#/usr/local/etc/cups#.

source: Configuring the CUPS Print Server
es: Configurando el servidor de impresión CUPS

source: After installation, a few files must be edited in order to configure the CUPS server. First, create or modify, as the case may be, the file [.filename]#/etc/devfs.rules# and add the following information to set the proper permissions on all potential printer devices and to associate printers with the `cups` user group:
es: Después de la instalación, se tienen que editar unos pocos ficheros para configurar el servidor CUPS. Primero, crea o modifica, según el caso, el fichero [.filename]#/etc/devfs.rules# y añade la siguiente información para establecer los permisos apropiados en todos los dispositivos de impresión y asociar impresoras con el grupo de usuarios `cups`:

source: Note that _X_, _Y_, and _Z_ should be replaced with the target USB device listed in the [.filename]#/dev/usb# directory that corresponds to the printer. To find the correct device, examine the output of man:dmesg[8], where [.filename]#ugenX.Y# lists the printer device, which is a symbolic link to a USB device in [.filename]#/dev/usb#.
es: Date cuenta de que _X_, _Y_ y _Z_ deberían ser reemplazados con el dispositivo USB listado en el directorio [.filename]#/dev/usb# y que corresponde a la impresora. Para encontrar el dispositivo correcto, examina la salida de man:dmesg[8], donde [.filename]#ugenX.Y# lista el dispositivo de impresión, que es un enlace simbólico a un dispositivo USB en [.filename]#/dev/usb#.

source: Next, add two lines to [.filename]#/etc/rc.conf# as follows:
es: Después, añade dos líneas a [.filename]#/etc/rc.conf# como sigue:

source: These two entries will start the CUPS print server on boot and invoke the local devfs rule created above, respectively.
es: Estas dos entradas levantarán el servidor de impresión de CUPS en el arranque e invocarán las reglas locales de devfs creadas arriba, respectivamente.

source: In order to enable CUPS printing under certain Microsoft(R) Windows(R) clients, the line below should be uncommented in [.filename]#/usr/local/etc/cups/mime.types# and [.filename]#/usr/local/etc/cups/mime.convs#:
es: Para activar la impresión CUPS bajo ciertos clientes Microsoft(R) Windows(R), se debe descomentar la línea de abajo en [.filename]#/usr/local/etc/cups/mime.types# y [.filename]#/usr/local/etc/cups/mime.convs#:

source: Once these changes have been made, the man:devfs[8] and CUPS systems must both be restarted, either by rebooting the computer or issuing the following two commands in a root terminal:
es: Una vez hechos estos cambios, se deben reiniciar los sistemas man:devfs[8] y CUPS, bien reiniciando el ordenador o ejecutando los siguientes dos comandos en una terminal root:

source: Configuring Printers on the CUPS Print Server
es: Configuración de impresoras en el servidor de impresión CUPS

source: After the CUPS system has been installed and configured, the administrator can begin configuring the local printers attached to the CUPS print server. This part of the process is very similar, if not identical, to configuring CUPS printers on other UNIX(R)-based operating systems, such as a Linux(R) distribution.
es: Después de que el sistema CUPS haya sido instalado y configurado, el administrador puede empezar a configurar las impresoras locales asociadas al servidor de impresión CUPS. Esta parte del proceso es muy similar, si no idéntica, a configurar impresoras CUPS en otros sistemas operativos basados en UNIX(R), como una distribución Linux(R).

source: The primary means for managing and administering the CUPS server is through the web-based interface, which can be found by launching a web browser and entering http://localhost:631[http://localhost:631] in the browser's URL bar. If the CUPS server is on another machine on the network, substitute the server's local IP address for `localhost`. The CUPS web interface is fairly self-explanatory, as there are sections for managing printers and print jobs, authorizing users, and more. Additionally, on the right-hand side of the Administration screen are several check-boxes allowing easy access to commonly-changed settings, such as whether to share published printers connected to the system, whether to allow remote administration of the CUPS server, and whether to allow users additional access and privileges to the printers and print jobs.
es: El medio principal para gestionar y administrar el servidor CUPS es mediante la interfaz basada en web, que se puede encontrar abriendo un navegador web y tecleando http://localhost:631[http://localhost:631] en la barra de direcciones del navegador. Se el servidor CUPS está en otra máquina de la red, sustituye `localhost` por la IP local del servidor. El interfaz web de CUPS es bastante auto explicativo, ya que hay secciones para gestionar impresores y trabajos de impresión, autorizar usuarios y más. Además, en el lado derecho de la pantalla de Administración hay varios check-boxes que permiten acceso sencillo a ajustes que cambian habitualmente, como si hay que compartir impresoras publicadas conectadas al sistema, si hay que permitir la administración remota del servidor CUPS y si hay que conceder a los usuarios acceso y privilegios adicionales para las impresoras y trabajos de impresión.

source: Adding a printer is generally as easy as clicking "Add Printer" at the Administration screen of the CUPS web interface, or clicking one of the "New Printers Found" buttons also at the Administration screen. When presented with the "Device" drop-down box, simply select the desired locally-attached printer, and then continue through the process. If one has added the package:print/gutenprint-cups[] or package:print/hplip[] ports or packages as referenced above, then additional print drivers will be available in the subsequent screens that might provide more stability or features.
es: Por lo general, añadir una impresora es tan fácil como hacer clic en "Add Printer" en la pantalla de Administración de la interfaz web de CUPS, o haciendo clic en uno de los botones "New Printers Found" también en la pantalla de Administración. Cuando se muestre el cuadro desplegable "Device", simplemente seleccione la impresora local deseada y continúe con el proceso. Si has agregado los ports o paquetes mencionados anteriormente package:print/gutenprint-cups[] o package:print/hplip[], entonces, los controladores de impresión adicionales estarán disponibles en las siguientes pantallas pudiendo proporcionar más estabilidad o características.

source: Configuring CUPS Clients
es: Configurando clientes de CUPS

source: Once the CUPS server has been configured and printers have been added and published to the network, the next step is to configure the clients, or the machines that are going to access the CUPS server. If one has a single desktop machine that is acting as both server and client, then much of this information may not be needed.
es: Una vez haya sido configurado el servidor CUPS y se hayan agregado y publicado impresoras en la red, el siguiente paso es configurar los clientes o las máquinas que van a acceder al servidor CUPS. Si uno tiene una sola máquina de escritorio que actúa como servidor y como cliente, es posible que gran parte de esta información no sea necesaria.

source: UNIX(R) Clients
es: Clientes UNIX(R)

source: CUPS will also need to be installed on your UNIX(R) clients. Once CUPS is installed on the clients, then CUPS printers that are shared across the network are often automatically discovered by the printer managers for various desktop environments such as GNOME or KDE. Alternatively, one can access the local CUPS interface on the client machine at http://localhost:631[http://localhost:631] and click on "Add Printer" in the Administration section. When presented with the "Device" drop-down box, simply select the networked CUPS printer, if it was automatically discovered, or select `ipp` or `http` and enter the IPP or HTTP URI of the networked CUPS printer, usually in one of the two following syntaxes:
es: CUPS necesitará estar instalado también en tus clientes UNIX(R). Una vez que CUPS esté instalado en los clientes, las impresoras CUPS que estén compartidas en la red se descubren automáticamente por los gestores de impresión de los diferentes entornos de escritorio como GNOME o KDE. De forma alternativa, uno puede acceder al interfaz local de CUPS en la máquina cliente en http://localhost:631[http://localhost:631] y pinchar en "Add Printer" en la sección de Administración. Cuando aparezca la caja de selección "Device", simplemente selecciona la impresora de red de CUPS, si fue automáticamente descubierta o selecciona `ipp` o `http`e introducir la IPP o la URI HTTP de la impresora de red CUPS, habitualmente con alguna de las dos sintaxis siguientes:

source: If the CUPS clients have difficulty finding other CUPS printers shared across the network, sometimes it is helpful to add or create a file [.filename]#/usr/local/etc/cups/client.conf# with a single entry as follows:
es: Si los clientes CUPS tienen dificultades encontrando otras impresoras CUPS compartidas en la red, a veces es útil añadir o crear un fichero [.filename]#/usr/local/etc/cups/client.conf# con una sola línea como la que sigue:

source: In this case, _server-ip_ would be replaced by the local IP address of the CUPS server on the network.
es: En este caso, _server-ip_ sería reemplazado por la dirección IP local del servidor CUPS en la red.

source: Windows(R) Clients
es: Clientes Windows(R)

source: Versions of Windows(R) prior to XP did not have the capability to natively network with IPP-based printers. However, Windows(R) XP and later versions do have this capability. Therefore, to add a CUPS printer in these versions of Windows(R) is quite easy. Generally, the Windows(R) administrator will run the Windows(R) `Add Printer` wizard, select `Network Printer` and then enter the URI in the following syntax:
es: Versiones de Windows(R) anteriores a XP no tenían la posibilidad de interactuar en red con impresoras basadas en IPP. Sin embargo, Windows(R) XP y posteriores tienen esta capacidad. Por lo tanto, añadir una impresora CUPS a estas versiones de Windows(R) es bastante fácil. Generalmente, el administrador de Windows(R) ejecutará el asistente `Add Printer` de Windows(R), seleccionará `Network Printer`e introducirá la URI con la siguiente sintaxis:

source: If one has an older version of Windows(R) without native IPP printing support, then the general means of connecting to a CUPS printer is to use package:net/samba413[] and CUPS together, which is a topic outside the scope of this chapter.
es: Si se tiene una versión más antigua de Windows(R) sin soporte nativo para impresión IPP, entonces la forma general de conectar a una impresora CUPS es utilizar el paquete package:net/samba413[] junto con CUPS, que es un tema que excede el ámbito de este capítulo.

source: CUPS Troubleshooting
es: Solución de problemas en CUPS

source: Difficulties with CUPS often lies in permissions. First, double check the man:devfs[8] permissions as outlined above. Next, check the actual permissions of the devices created in the file system. It is also helpful to make sure your user is a member of the `cups` group. If the permissions check boxes in the Administration section of the CUPS web interface do not seem to be working, another fix might be to manually backup the main CUPS configuration file located at [.filename]#/usr/local/etc/cups/cupsd.conf# and edit the various configuration options and try different combinations of configuration options. One sample [.filename]#/usr/local/etc/cups/cupsd.conf# to test is listed below. Please note that this sample [.filename]#cupsd.conf# sacrifices security for easier configuration; once the administrator successfully connects to the CUPS server and configures the clients, it is advisable to revisit this configuration file and begin locking down access.
es: Las dificultades con CUPS habitualmente tienen que ver con permisos. Primero, comprueba los permisos de man:devfs[8] como se ha mencionado arriba. Seguido, comprueba los permisos reales de los dispositivos creados en el sistema de ficheros. También ayuda asegurarse de que tu usuario es miembro del grupo `cups`. Si los check boxes de permisos en la sección de Administración del interfaz web de CUPS parece que no están funcionando, otro arreglo podría ser hacer una copia de seguridad manual del fichero de configuración de CUPS que se encuentra en [.filename]#/usr/local/etc/cups/cupsd.conf# y editar las distintas opciones de configuración e intentar distintas combinaciones de opciones de configuración.
