Repository: Wang-Yan-Hao/FreeBSD-Online-Document-Editor
Catalog: documentation/content/*/articles/leap-seconds/_index.po
Languages: pt_br

source: A short description of how leap seconds are handled on FreeBSD
pt_br: Uma breve descrição de como os leap seconds são tratados no FreeBSD

source: FreeBSD Support for Leap Seconds
pt_br: Suporte do FreeBSD a Leap Seconds

source: Introduction
pt_br: Introdução

source: A _leap second_ is an one second adjustment made at specific times of year to UTC to synchronize atomic time scales with variations in the rotation of the Earth. This article describes how FreeBSD interacts with leap seconds.
pt_br: Um _leap second_ é o ajuste de um segundo feito em momentos específicos do ano para sincronizar a escala atômica de tempo do UTC com a variação da rotação da terra. Esse artigo descreve como o FreeBSD interage com o leap seconds.

source: As of this writing, the next leap second will occur at 2015-Jun-30 23:59:60 UTC. This leap second will occur during a business day for North and South America and the Asia/Pacific region.
pt_br: No momento em que este artigo está sendo escrito, a próxima ocorrência do leap second irá acontecer em 30 de junho de 2015 as 23:59:60 UTC. Esse leap second ira ocorrer durante um dia útil para as Américas do Norte e do Sul e a região da Ásia/Pacifico.

source: Leap seconds are announced by http://datacenter.iers.org/[IERS] on http://datacenter.iers.org/web/guest/bulletins/-/somos/5Rgv/product/16[Bulletin C].
pt_br: Leap seconds são anunciados pelo http://datacenter.iers.org/[IERS] no http://datacenter.iers.org/web/guest/bulletins/-/somos/5Rgv/product/16[Bulletin C].

source: Standard leap second behavior is described in https://tools.ietf.org/html/rfc7164#section-3[RFC 7164]. Also see man:time2posix[3].
pt_br: O comportamento padrão do leap Seconds é descrito na https://tools.ietf.org/html/rfc7164#section-3[RFC 7164]. Veja também em man:time2posix[3].

source: Default Leap Second Handling on FreeBSD
pt_br: Manipulação padrão do leap seconds no FreeBSD

source: The easiest way to handle leap seconds is with the POSIX time rules FreeBSD uses by default, combined with extref:{handbook}network-servers[NTP]. When man:ntpd[8] is running and the time is synchronized with upstream NTP servers that handle leap seconds correctly, the leap second will cause the system time to automatically repeat the last second of the day. No other adjustments are necessary.
pt_br: A maneira mais fácil de manipular o leap seconds é com a regra de tempo POSIX que é utilizada por padrão pelo FreeBSD, combinada com o link:{handbook}#network-ntp[NTP]. Quando o man:ntpd[8] está sendo executado e o tempo é sincronizado com os servidores NTP de upstream que gerenciam o leap seconds corretamente, o leap second causará a repetição do último segundo do dia de forma automática. Nenhum outro ajuste será necessário.

source: If the upstream NTP servers do not handle leap seconds correctly, man:ntpd[8] will step the time by one second after the errant upstream server has noticed and stepped itself.
pt_br: Se os servidores de NTP upstream não gerenciarem o leap seconds corretamente, o man:ntpd[8] irá avançar em um segundo após o servidor se corrigir.

source: If NTP is not being used, manual adjustment of the system clock will be required after the leap second has passed.
pt_br: Se o NTP não está sendo utilizado, será necessário um ajuste manual do relógio do sistema apois o leap seconds ter passado.

source: Cautions
pt_br: Cuidados

source: Leap seconds are inserted at the same instant all over the world: UTC midnight. In Japan that is mid-morning, in the Pacific mid-day, in the Americas late afternoon, and in Europe at night.
pt_br: Os Leap seconds são inseridos no mesmo instante em todo o mundo a meia noite UTC. No Japão será no meio da manhã e no Pacífico ao meio dia, nas Américas a tarde e na Europa à noite.

source: We believe and expect that FreeBSD, if provided correct and stable NTP service, will work as designed during this leap second, as it did during the previous ones.
pt_br: Nos acreditamos e esperamos que o FreeBSD, se provido de um serviço de NTP estável, irá funcionar como foi especificado durante o leap second, como aconteceu nos anteriores.

source: However, we caution that practically no applications have ever asked the kernel about leap seconds. Our experience is that, as designed, leap seconds are essentially a replay of the second before the leap second, and this is a surprise to most application programmers.
pt_br: Enrtetanto, nós alertamos que praticamente nenhum aplicativo nunca questionou o kernel sobre leap seconds. Nossa experiência é que, como projetado, leap seconds são, essencialmente, a repetição do último segundo antes do leap second, e isso é uma surpresa para a maioria dos programadores.

source: Other operating systems and other computers may or may not handle the leap-second the same way as FreeBSD, and systems without correct and stable NTP service will not know anything about leap seconds at all.
pt_br: Outros sistemas operacionais e computadores podem ou não manipular o leap seconds da mesma maneira que o FreeBSD e sistemas sem um serviço correto e estável de NTP não terão conhecimento algum sobre a ocorrência de leap seconds.

source: It is not unheard of for computers to crash because of leap seconds, and experience has shown that a large fraction of all public NTP servers might handle and announce the leap second incorrectly.
pt_br: Não é inédito que os computadores travem por causa do leap seconds, e a experiência mostra que uma grande parte de todos os servidores públicos de NTP podem manipular e anunciar o leap seconds de forma incorreta.

source: Please try to make sure nothing horrible happens because of the leap second.
pt_br: Por favor, tente garantir que nada horrível acontecerá por causa do leap seconds.

source: Testing
pt_br: Testando

source: It is possible to test whether a leap second will be used. Due to the nature of NTP, the test might work up to 24 hours before the leap second. Some major reference clock sources only announce leap seconds one hour ahead of the event. Query the NTP daemon:
pt_br: É possível testar se um leap seconds será utilizado. Devido a natureza do NTP, o teste deve funcionar até 24 horas antes do lead seconds. Algumas das principais fontes de referência de tempo somente anunciam o leap seconds uma hora antes do evento. Consulte o daemon do NTP:

source: Output that includes `leap_add_sec` indicates proper support of the leap second. Before the 24 hours leading up to the leap second, or after the leap second has passed, `leap_none` will be shown.
pt_br: Uma saída que inclua `leap_add_sec` indica o suporte adequado ao leap second. Antes de 24 horas até a ocorrência do leap second, ou depois dele já ter ocorrido, a saída do comando irá mostrar `leap_none`.

source: Conclusion
pt_br: Conclusão

source: In practice, leap seconds are usually not a problem on FreeBSD. We hope that this overview helps clarify what to expect and how to make the leap second event proceed more smoothly.
pt_br: Na prática, o leap seconds não é um problema do FreeBSD. Esperamos que esta visão geral, ajude-o a esclarecer oque esperar e como tornar o evento de leap seconds o menos traumático possível.
