Repository: Wang-Yan-Hao/FreeBSD-Online-Document-Editor
Catalog: freebsd-doc-main/documentation/content/*/articles/fonts/_index.po
Languages: es

source: % cd /tmp % cat >example.t <<EOF .sp 5 .ps 16 This is an example of the Showboat font: .br .ps 48 .vs (\n(.s+2)p .sp .ft SHOWBOAT ABCDEFGHI .br JKLMNOPQR .br STUVWXYZ .sp .ps 16 .vs (\n(.s+2)p .fp 5 SHOWBOAT .ft R To use it for the first letter of a paragraph, it will look like: .sp 50p \s(48\f5H\s0\fRere is the first sentence of a paragraph that uses the showboat font as its first letter. Additional vertical space must be used to allow room for the larger letter. EOF % groff -Tps example.t >example.ps
es: % cd /tmp % cat >example.t <<EOF .sp 5 .ps 16 Esto es un ejemplo de la fuente showboat: .br .ps 48 .vs (\n(.s+2)p .sp .ft SHOWBOAT ABCDEFGHI .br JKLMNOPQR .br STUVWXYZ .sp .ps 16 .vs (\n(.s+2)p .fp 5 SHOWBOAT .ft R Para usarla como primera letra de un párrafo, se parecerá a: .sp 50p \s(48\f5H\s0\fRere es la primera frase de un párrafo que usa la fuente showboat como su primera letra. Se debe usar espaciado vertical adicional para proporcionar espacio para la letra más grande. EOF % groff -Tps example.t >example.ps

source: To use ghostscript/ghostview % ghostview example.ps
es: Para usar ghostscript/ghostview % ghostview example.ps

source: To print it % lpr -Ppostscript example.ps
es: Para imprimirlo % lpr -Ppostscript example.ps

source: References: [.filename]#/usr/src/gnu/usr.bin/groff/afmtodit/afmtodit.man#, man:groff_font[5], man:groff_char[7], man:pfbtops[1].
es: Referencias: [.filename]#/usr/src/gnu/usr.bin/groff/afmtodit/afmtodit.man#, man:groff_font[5], man:groff_char[7], man:pfbtops[1].

source: Converting TrueType Fonts to a groff/PostScript Format For groff
es: Conversión de tipos TrueType a un formato groff/PostScript para groff

source: This potentially requires a bit of work, simply because it depends on some utilities that are not installed as part of the base system. They are:
es: Esto puede llevar un poco de trabajo por la sencilla razón de que depende de algunas herramientas que no se instalan como parte del sistema base:

source: TrueType to PostScript conversion utilities. This allows conversion of a TrueType font to an ascii font metric ([.filename]#.afm#) file.
es: Herramientas de conversión de TrueType a PostScript. Esto permite la conversión de tipos TrueType a archivos de métrica de tipo ascii ([.filename]#.afm#).

source: Currently available at http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/[http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/]. Note: These files are PostScript programs and must be downloaded to disk by holding down kbd:[Shift] when clicking on the link. Otherwise, your browser may try to launch ghostview to view them.
es: Actualmente disponible en http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/[http://sunsite.icm.edu.pl/pub/GUST/contrib/BachoTeX98/ttf2pf/]. Nota: Estos ficheros son programas PostScript y se deben descargar a disco manteniendo pulsado kbd:[Shift] cuando se hace click en el enlace. De otro modo tu navegador podría intentar arrancar ghostview para visualizarlos.

source: The files of interest are:
es: Los archivos importantes para esta tarea son:

source: The funny upper/lower case is due to their being intended also for DOS shells. [.filename]#ttf2pf.ps# makes use of the others as upper case, so any renaming must be consistent with this. (Actually, [.filename]#GS_TTF.PS# and [.filename]#PFS2AFM.PS# are supposedly part of the Ghostscript distribution, but it is just as easy to use these as an isolated utility. FreeBSD does not seem to include the latter.) You also may want to have these installed to [.filename]#/usr/local/share/groff_font/devps#(?).
es: Todo este lío de mayúsculas y minúsculas en los nombres es porque se tiene en cuenta las shells de DOS. [.filename]#ttf2pf.ps# utiliza el resto como mayúsculas, por lo que cualquier cambio de nombre debe tener esto en cuenta. (En realidad, [.filename]#GS_TTF.PS# y [.filename]#PFS2AFM.PS# son parte de la distribución de Ghostscript, pero se pueden usar como herramientas independientes. FreeBSD no incluye esta última.) También puede ser que quieras instalarlas en [.filename]#/usr/local/share/groff_font/devps#(?).

source: Creates font files for use with groff from ascii font metrics file. This usually resides in the directory, [.filename]#/usr/src/contrib/groff/afmtodit#, and requires some work to get going.
es: Crea ficheros de fuentes para usarlas con groff a partir de ficheros de métricas ascii. Esto normalmente se encuentra en el directorio [.filename]#/usr/src/contrib/groff/afmtodit# y requiere algo de trabajo hacerlo funcionar.

source: If you are paranoid about working in the [.filename]#/usr/src# tree, simply copy the contents of the above directory to a work location.
es: Si crees que trabajar en [.filename]#/usr/src# no es muy buena idea, simplemente copia el contenido del directorio anterior en otra ubicación.

source: In the work area, you will need to make the utility. Just type:
es: En el directorio, necesitarás compilar la utilidad. Escribe:

source: You may also need to copy [.filename]#/usr/contrib/groff/devps/generate/textmap# to [.filename]#/usr/share/groff_font/devps/generate# if it does not already exist.
es: Es posible que tengas que copiar también [.filename]#/usr/contrib/groff/devps/generate/textmap# a [.filename]#/usr/share/groff_font/devps/generate# si no existe.

source: Once all these utilities are in place, you are ready to commence:
es: Una vez que todas estas utilidades estén en su sitio, estará listo para comenzar:

source: Create [.filename]#.afm# by typing:
es: Crea [.filename]#.afm# tecleando:

source: Where, _TTF_name_ is your TrueType font file, _PS_font_name_ is the file name for [.filename]#.pfa#, _AFM_name_ is the name you wish for [.filename]#.afm#. If you do not specify output file names for the [.filename]#.pfa# or [.filename]#.afm# files, then default names will be generated from the TrueType font file name.
es: Donde _TTF_name_ es tu fichero de fuentes TrueType, _PS_font_name_ es el nombre del fichero para [.filename]#.pfa#, _AFM_name_ es el nombre que quieres darle a [.filename]#.afm#. Si no especificas nombres para los ficheros [.filename]#.pfa# o [.filename]#.afm#, se generarán nombres por defecto para los ficheros de fuentes TrueType.

source: This also produces a [.filename]#.pfa#, the ascii PostScript font metrics file ([.filename]#.pfb# is for the binary form). This will not be needed, but could (I think) be useful for a fontserver.
es: Esto también produce un archivo [.filename]#.pfa#, el archivo ascii de las métricas del tipo PostScript ([.filename]#.pfb# es para el formato binario). Esto no será necesario, pero podría (creo) ser útil para un servidor de fuentes.

source: For example, to convert the 30f9 Barcode font using the default file names, use the following command:
es: Por ejemplo, para convertir el tipo para código de barras 30f9 usando los nombres de archivo predeterminados use el siguiente comando:

source: If you want the converted fonts to be stored in [.filename]#A.pfa# and [.filename]#B.afm#, then use this command:
es: Si quieres almacenar las fuentes convertidas en [.filename]#A.pfa# y [.filename]#B.afm#, usa este comando:

source: Create the groff PostScript file:
es: Crea el fichero PostScript de groff:

source: Change directories to [.filename]#/usr/share/groff_font/devps# so as to make the following command easier to execute. You will probably need root privileges for this. (Or, if you are paranoid about working there, make sure you reference the files [.filename]#DESC#, [.filename]#text.enc# and [.filename]#generate/textmap# as being in this directory.)
es: Ve al directorio [.filename]#/usr/share/groff_font/devps# para que el siguiente comando sea más fácil de ejecutar. Probablemente necesitarás privilegios de root. (O si no te sientes cómodo trabajando en ese directorio, asegúrate de hacer referencia a los archivos [.filename]#DESC#, [.filename]#text.enc# y [.filename]#generate/textmap# que están en el directorio.)

source: Where, [.filename]#file.afm# is the _AFM_name_ created by `ttf2pf.ps` above, and _PS_font_name_ is the font name used from that command, as well as the name that man:groff[1] will use for references to this font. For example, assuming you used the first `tiff2pf.ps` above, then the 3of9 Barcode font can be created using the command:
es: Donde [.filename]#file.afm# es el _AFM_name_ creado arriba por `ttf2pf.ps` y _PS_font_name_ es el nombre de fuente utilizado en ese comando, así como el nombre que man:groff[1] utilizará para referenciar esta fuente. Por ejemplo, asumiendo que has usado el primer `tiff2pf.ps` de arriba, entonces la fuente 3of9 Barcode se puede crear con el siguiente comando:

source: Ensure that the resulting _PS_font_name_ file (e.g., [.filename]#3of9# in the example above) is located in the directory [.filename]#/usr/share/groff_font/devps# by copying or moving it there.
es: Asegúrate de que el fichero resultado _PS_font_name_ (es decir, [.filename]#3of9# en el ejemplo anterior) se encuentra en el directorio [.filename]#/usr/share/groff_font/devps# ya sea copiándolo o moviéndolo a él.

source: Note that if [.filename]#ttf2pf.ps# assigns a font name using the one it finds in the TrueType font file and you want to use a different name, you must edit the [.filename]#.afm# prior to running `afmtodit`. This name must also match the one used in the Fontmap file if you wish to pipe man:groff[1] into man:gs[1].
es: Nótese que si [.filename]#ttf2pf.ps# asigna un nombre de fuente utilizando el que se encuentra en el fichero de fuentes TrueType y quieres utilizar un nombre diferente, debes editar el fichero [.filename]#.afm# antes de ejecutar `afmtodit`. Este nombre también tiene que coincidir con el utilizado en el fichero Fontmap si quieres conectar mediante una tubería (pipe) man:groff[1] con man:gs[1].

source: Can TrueType Fonts be Used with Other Programs?
es: ¿Se pueden usar los tipos TrueType con otros programas?

source: The TrueType font format is used by Windows, Windows 95, and Mac's. It is quite popular and there are a great number of fonts available in this format.
es: Windows, Windows 95 y Mac utilizan el formato de tipo TrueType. Es bastante popular y hay una gran cantidad de fuentes disponibles en este formato.

source: Unfortunately, there are few applications that I am aware of that can use this format: Ghostscript and Povray come to mind. Ghostscript's support, according to the documentation, is rudimentary and the results are likely to be inferior to type 1 fonts. Povray version 3 also has the ability to use TrueType fonts, but I rather doubt many people will be creating documents as a series of raytraced pages :-).
es: Desafortunadamente, hay pocas aplicaciones que conozca que puedan utilizar este formato: me vienen a la mente Ghostscript y Povray. El soporte en Ghostscript, según la documentación, es rudimentario y los resultados en general inferiores a los obtenidos con fuentes tipo 1. La versión 3 de Povray también puede utilizar fuentes TrueType, pero dudo de que haya mucha gente creando documentos como una serie de páginas de trazado de rayos :-).

source: This rather dismal situation may soon change. The http://www.freetype.org/[FreeType Project] is currently developing a useful set of FreeType tools:
es: Esta deprimente situación podría cambiar pronto. El http://www.freetype.org/[Proyecto FreeType] está actualmente desarrollando un útil conjunto de herramientas FreeType:

source: The `xfsft` font server for X11 can serve TrueType fonts in addition to regular fonts. Though currently in beta, it is said to be quite usable. See http://www.dcs.ed.ac.uk/home/jec/programs/xfsft/[Juliusz Chroboczek's page] for further information. Porting instructions for FreeBSD can be found at http://math.missouri.edu/~stephen/software/[Stephen Montgomery's software page].
es: El servidor de fuentes `xfsft` para X11 puede servir fuentes TrueType además de las fuentes normales. Aunque todavía está en beta, parece que es usable. Visita http://www.dcs.ed.ac.uk/home/jec/programs/xfsft/[Juliusz Chroboczek's page] para más información. Se pueden encontrar instrucciones para portarlo a FreeBSD en http://math.missouri.edu/~stephen/software/[Stephen Montgomery's software page].

source: xfstt is another font server for X11, available under link:ftp://sunsite.unc.edu/pub/Linux/X11/fonts/[ftp://sunsite.unc.edu/pub/Linux/X11/fonts/].
es: xfstt es otro servidor de fuentes para X11 disponible en link:ftp://sunsite.unc.edu/pub/Linux/X11/fonts/[ftp://sunsite.unc.edu/pub/Linux/X11/fonts/].

source: A program called `ttf2bdf` can produce BDF files suitable for use in an X environment from TrueType files. Linux binaries are said to be available from link:ftp://crl.nmsu.edu/CLR/multiling/General/[ftp://crl.nmsu.edu/CLR/multiling/General/].
es: Un programa llamado `ttf2bdf` puede generar ficheros BDF a partir de ficheros TrueType, aptos para ser usados en un entorno X. Parece que hay binarios de Linux disponibles en link:ftp://crl.nmsu.edu/CLR/multiling/General/[ftp://crl.nmsu.edu/CLR/multiling/General/].

source: and others ...
es: y otras...

source: Where Can Additional Fonts be Obtained?
es: ¿Dónde se pueden obtener tipos adicionales?

source: Many fonts are available on the Internet. They are either entirely free, or are share-ware. In addition many fonts are available in the [.filename]#x11-fonts/# category in the ports collection
es: Hay muchos tipos disponibles en Internet. Son totalmente gratuitos o share-ware. Además, muchos de esos tipos están disponibles en la categoría de ports [.filename]#x11-fonts/#

source: Additional Questions
es: Preguntas adicionales

source: What use are the [.filename]#.pfm# files?
es: ¿Para qué se usan los ficheros [.filename]#.pfm#?

source: Can one generate the [.filename]#.afm# from a [.filename]#.pfa# or [.filename]#.pfb#?
es: ¿Se puede generar un fichero [.filename]#.afm# a partir de un [.filename]#.pfa# o [.filename]#.pfb#?

source: How to generate the groff character mapping files for PostScript fonts with non-standard character names?
es: ¿Cómo generar ficheros de mapas de caracteres de groff para fuentes PostScript con nombres de caracteres no estándar?

source: Can xditview and devX?? devices be set up to access all the new fonts?
es: ¿Se pueden configurar los dispositivos xditview y devX para acceder a todos los tipos nuevos?

source: It would be good to have examples of using TrueType fonts with Povray and Ghostscript.
es: Sería bueno tener ejemplos de uso de fuentes TrueType con Povray y Ghostscript.
