Repository: Wang-Yan-Hao/FreeBSD-Online-Document-Editor
Catalog: freebsd-doc-main/documentation/content/*/articles/fonts/_index.po
Languages: es

source: A description of the various font technologies in FreeBSD, and how to use them with different programs
es: Una descripción de las distintas tecnologías de fuentes en FreeBSD y cómo utilizarlas con diferentes programas

source: Fonts and FreeBSD
es: Tipos de letra y FreeBSD

source: Abstract
es: Resumen

source: This document contains a description of the various font files that may be used with FreeBSD and the syscons driver, X11, Ghostscript and Groff. Cookbook examples are provided for switching the syscons display to 80x60 mode, and for using type 1 fonts with the above application programs.
es: Este documento contiene una descripción de los distintos ficheros de fuentes que pueden ser utilizados con FreeBSD y el driver syscons, X11, Ghostscript y Groff. Se proporcionan ejemplos para cambiar el display de syscons a modo 80x60 y para utilizar fuentes tipo 1 con los programas de aplicaciones mostrados arriba.

source: Introduction
es: Introducción

source: There are many sources of fonts available, and one might ask how they might be used with FreeBSD. The answer can be found by carefully searching the documentation for the component that one would like to use. This is very time consuming, so this tutorial is an attempt to provide a shortcut for others who might be interested.
es: Hay muchos orígenes (sources) de tipos disponibles y a veces no es fácil discernir cómo usarlos en FreeBSD. La respuesta puede estar en la documentación del componente que desea utilizar. Esto puede llevar su tiempo, por lo que este tutorial intenta proporcionar un atajo para quienes puedan estar interesados.

source: Basic Terminology
es: Terminología básica

source: There are many different font formats and associated font file suffixes. A few that will be addressed here are:
es: Hay muchos formatos de tipos diferentes y sufijos de archivos de tipos asociados. En este artículo abordaremos unos cuantos:

source: PostScript(R) type 1 fonts. The [.filename]#.pfa# is the __A__scii form and [.filename]#.pfb# the __B__inary form.
es: Fuentes PostScript(R) tipo 1. El [.filename]#.pfa# es la forma __A__scii y el [.filename]#.pfb# la forma __B__inaria.

source: The font metrics associated with a type 1 font.
es: Métricas del tipo asociadas al tipo Tipo 1.

source: The printer font metrics associated with a type 1 font.
es: Métricas de impresión del tipo asociadas al tipo Tipo 1.

source: A TrueType(R) font
es: Una fuente TrueType(R)

source: An indirect reference to a TrueType font (not an actual font)
es: Una referencia indirecta a un tipo TrueType (no es un tipo real)

source: Bitmapped screen fonts
es: Tipos de pantalla de mapa de bits

source: The [.filename]#.fot# is used by Windows(R) as sort of a symbolic link to the actual TrueType(R) font ([.filename]#.ttf#) file. The [.filename]#.fon# font files are also used by Windows. I know of no way to use this font format with FreeBSD.
es: La extensión [.filename]#.fot# se usa en Windows(R) como una especie de enlace simbólico al fichero real ([.filename]#.ttf#) de la fuente TrueType(R). Los ficheros de fuentes [.filename]#.fon# también se usan en Windows. No conozco una forma de utilizar este formato de fuente en FreeBSD.

source: What Font Formats Can I Use?
es: ¿Qué formatos de tipo puedo usar?

source: Which font file format is useful depends on the application being used. FreeBSD by itself uses no fonts. Application programs and/or drivers may make use of the font files. Here is a small cross reference of application/driver to the font type suffixes:
es: Qué formato de fuente es útil depende de la aplicación. FreeBSD por sí mismo no utiliza fuentes. Las aplicaciones y/o los controladores pueden utilizar archivos de fuentes. A continuación se muestra una pequeña referencia cruzada de la aplicación/controlador para los sufijos de tipo:

source: Driver
es: Controlador

source: Application
es: Aplicación

source: The [.filename]#.fnt# suffix is used quite frequently. I suspect that whenever someone wanted to create a specialized font file for their application, more often than not they chose this suffix. Therefore, it is likely that files with this suffix are not all the same format; specifically, the [.filename]#.fnt# files used by syscons under FreeBSD may not be the same format as a [.filename]#.fnt# one encounters in the MS-DOS(R)/Windows(R) environment. I have not made any attempt at using other [.filename]#.fnt# files other than those provided with FreeBSD.
es: El sufijo [.filename]#.fnt# se usa con bastante frecuencia. Sospecho que cuando alguien quería crear un fichero de fuente especializado para su aplicación, por lo general escogía este sufijo. Por lo tanto, es probable que ficheros con este sufijo no sean todos del mismo formato; en concreto, los ficheros [.filename]#.fnt# utilizados por syscons en FreeBSD podrían no ser del mismo formato que un [.filename]#.fnt# que se pueda encontrar en un entorno MS-DOS(R)/Windows(R). No he intentado utilizar otros ficheros [.filename]#.fnt# distintos a los que se proporcionan con FreeBSD.

source: Setting a Virtual Console to 80x60 Line Mode
es: Configuración de una consola virtual en modo de línea 80x60

source: First, an 8x8 font must be loaded. To do this, [.filename]#/etc/rc.conf# should contain the line (change the font name to an appropriate one for your locale):
es: En primer lugar se debe cargar una fuente 8x8. Para ello, el archivo [.filename]#/etc/rc.conf# debe tener la línea (cambie el nombre del tipo por el que sea más apropiado en su región):

source: font8x8="iso-8x8" # font 8x8 from /usr/share/syscons/fonts/* (or NO).
es: font8x8="iso-8x8" # tipo 8x8 de /usr/share/syscons/fonts/* (o NO para cargar el tipo por defecto).

source: The command to actually switch the mode is man:vidcontrol[1]:
es: El comando para cambiar realmente el modo es man:vidcontrol[1]:

source: Various screen-oriented programs, such as man:vi[1], must be able to determine the current screen dimensions. As this is achieved this through `ioctl` calls to the console driver (such as man:syscons[4]) they will correctly determine the new screen dimensions.
es: Varios programas orientados a consola, como man:vi[1], tienen que ser capaces de determinar las dimensiones actuales de la pantalla. Como esto se consigue mediante llamadas `ioctl` al controlador de la consola (como man:syscons[4]) se determinará correctamente las nuevas dimensiones de la pantalla.

source: To make this more seamless, one can embed these commands in the startup scripts so it takes place when the system boots. To do this is add this line to [.filename]#/etc/rc.conf#.
es: Para hacerlo más sencillo, se pueden añadir estos comandos a los scripts de inicio del sistema para que se ejecuten en el arranque. Agrega esta línea en el archivo [.filename]#/etc/rc.conf#.

source: allscreens_flags="VGA_80x60" # Set this vidcontrol mode for all virtual screens
es: allscreens_flags="VGA_80x60" # Establecer el modo vidcontrol para todas las pantallas virtuales

source: References: man:rc.conf[5], man:vidcontrol[1].
es: Referencias: man:rc.conf[5], man:vidcontrol[1].

source: Using Type 1 Fonts with X11
es: Utilizar Fuentes Tipo 1 con X11

source: X11 can use either the [.filename]#.pfa# or the [.filename]#.pfb# format fonts. The X11 fonts are located in various subdirectories under [.filename]#/usr/X11R6/lib/X11/fonts#. Each font file is cross referenced to its X11 name by the contents of [.filename]#fonts.dir# in each directory.
es: X11 puede utilizar los formatos [.filename]#.pfa# o [.filename]#.pfb# . Las fuentes de X11 se encuentran en varios subdirectorios bajo [.filename]#/usr/X11R6/lib/X11/fonts#. Cada fichero de fuentes está referenciado a su nombre X11 por el contenido de [.filename]#fonts.dir# en cada directorio.

source: There is already a directory named [.filename]#Type1#. The most straight forward way to add a new font is to put it into this directory. A better way is to keep all new fonts in a separate directory and use a symbolic link to the additional font. This allows one to more easily keep track of ones fonts without confusing them with the fonts that were originally provided. For example:
es: Ya existe un directorio llamado [.filename]#Type1#.. La forma más directa de añadir una nueva fuente es ponerla en ese directorio. Una forma aun mejor sería colocar todas las fuentes que quieras añadir en un directorio separado y utilizar un enlace simbólico a las fuentes adicionales. Esto permite identificar los tipos sin mezclarlos con los originales. Por ejemplo:

source: Create a directory to contain the font files % mkdir -p /usr/local/share/fonts/type1 % cd /usr/local/share/fonts/type1
es: Crear un directorio para guardar los ficheros de fuentes % mkdir -p /usr/local/share/fonts/type1 % cd /usr/local/share/fonts/type1

source: Place the .pfa, .pfb and .afm files here
es: Pon los ficheros .pfa, .pfb y .afm aquí

source: One might want to keep readme files, and other documentation
es: Uno podría querer mantener los ficheros readme y otra documentación

source: for the fonts here also % cp /cdrom/fonts/atm/showboat/showboat.pfb . % cp /cdrom/fonts/atm/showboat/showboat.afm .
es: para las fuentes también aquí % cp /cdrom/fonts/atm/showboat/showboat.pfb . % cp /cdrom/fonts/atm/showboat/showboat.afm .

source: Maintain an index to cross reference the fonts % echo showboat - InfoMagic CICA, Dec 1994, /fonts/atm/showboat >>INDEX
es: Mantener un índice para tener referencias cruzadas de las fuentes % echo showboat - InfoMagic CICA, Dec 1994, /fonts/atm/showboat >>INDEX

source: Now, to use a new font with X11, one must make the font file available and update the font name files. The X11 font names look like:
es: Ahora, para utilizar una nueva fuente con X11, el fichero de la fuente debe estar disponible y se tienen que actualizar los nombres de los ficheros de fuentes. Los nombres de fuentes de X11 se parecen a esto:

source: -bitstream-charter-medium-r-normal-xxx-0-0-0-0-p-0-iso8859-1 | | | | | | | | | | | | \ \ | | | | | \ \ \ \ \ \ \ +----+- character set | | | | \ \ \ \ \ \ \ +- average width | | | | \ \ \ \ \ \ +- spacing | | | \ \ \ \ \ \ +- vertical res. | | | \ \ \ \ \ +- horizontal res. | | | \ \ \ \ +- points | | | \ \ \ +- pixels | | | \ \ \ foundry family weight slant width additional style
es: -bitstream-charter-medium-r-normal-xxx-0-0-0-0-p-0-iso8859-1 | | | | | | | | | | | | \ \ | | | | | \ \ \ \ \ \ \ +----+- juego de caracteres | | | | \ \ \ \ \ \ \ +- ancho promedio | | | | \ \ \ \ \ \ +- espaciado | | | \ \ \ \ \ \ +- resolución vertical. | | | \ \ \ \ \ +- resolución horizontal. | | | \ \ \ \ +- puntos | | | \ \ \ +- píxeles | | | \ \ \ tipo familia densidad inclinación anchura estilo adicional

source: A new name needs to be created for each new font. If you have some information from the documentation that accompanied the font, then it could serve as the basis for creating the name. If there is no information, then you can get some idea by using man:strings[1] on the font file. For example:
es: Se tiene que crear un nombre nuevo para cada fuente nueva. Si tienes algo de información de la documentación que viene con la fuente, podría servir como base para crear el nombre. Si no hay información, entonces puedes obtener ideas utilizando man:strings[1] sobre el fichero de fuentes. Por ejemplo:

source: Using this information, a possible name might be:
es: Basándonos esta información podríamos usar un nombre como este:

source: The components of our name are:
es: Los componentes de nuestro nombre son:

source: Foundry
es: Tipo

source: Lets just name all the new fonts `type1`.
es: Llamemos a todas las fuentes nuevas `type 1`.

source: Family
es: Familia

source: The name of the font.
es: El nombre del tipo.

source: Weight
es: Densidad

source: Normal, bold, medium, semibold, etc. From the man:strings[1] output above, it appears that this font has a weight of __medium__.
es: Normal, bold, medium, semibold, etc. De la salida de man:strings[1] de arriba, parece que esta fuente tiene un peso __medium__.

source: Slant
es: Inclinación

source: __r__oman, __i__talic, __o__blique, etc. Since the _ItalicAngle_ is zero, _roman_ will be used.
es: __r__oman, __i__talic, __o__blique, etc. Puesto que _ItalicAngle_ es cero, se usará _roman_.

source: Width
es: Anchura

source: Normal, wide, condensed, extended, etc. Until it can be examined, the assumption will be __normal__.
es: Normal, wide, condensed, extended, etc. Hasta que se pueda examinar, se asumirá que será __normal__.

source: Additional style
es: Estilo adicional

source: Usually omitted, but this will indicate that the font contains decorative capital letters.
es: Generalmente se omite, pero esto indicará que el tipo contiene mayúsculas decorativas.

source: Spacing
es: Espaciado

source: proportional or monospaced. _Proportional_ is used since _isFixedPitch_ is false.
es: proportional o monospaced. Se usa _Proportional_ ya que _isFixedPitch_ es falso.

source: All of these names are arbitrary, but one should strive to be compatible with the existing conventions. A font is referenced by name with possible wild cards by an X11 program, so the name chosen should make some sense. One might begin by simply using
es: Todos estos nombres son arbitrarios pero uno debería intentar ser compatible con las convenciones ya existentes. Una fuente es referenciada por un programa X11 por el nombre con posibles wild cards, así que el nombre escogido debería tener algo de sentido. Uno podría empezar simplemente por usar

source: as the name, and then use man:xfontsel[1] to examine it and adjust the name based on the appearance of the font.
es: como nombre y después usar man:xfontsel[1] para examinarlo y ajustar el nombre en función de la apariencia de la fuente.

source: So, to complete our example:
es: Para completar nuestro ejemplo:

source: Make the font accessible to X11 % cd /usr/X11R6/lib/X11/fonts/Type1 % ln -s /usr/local/share/fonts/type1/showboat.pfb .
es: Hacer la fuente accesible a X11 % cd /usr/X11R6/lib/X11/fonts/Type1 % ln -s /usr/local/share/fonts/type1/showboat.pfb .

source: Edit fonts.dir and fonts.scale, adding the line describing the font and incrementing the number of fonts which is found on the first line. % ex fonts.dir :1p 25 :1c 26 . :$a showboat.pfb -type1-showboat-medium-r-normal-decorative-0-0-0-0-p-0-iso8859-1 . :wq
es: Edita fonts.dir y fonts.scale, añadiendo la linea que describe la fuente e incrementa el número de fuentes que se encuentra en la primera linea. % ex fonts.dir :1p 25 :1c 26 . :$a showboat.pfb -type1-showboat-medium-r-normal-decorative-0-0-0-0-p-0-iso8859-1 . :wq

source: fonts.scale seems to be identical to fonts.dir... % cp fonts.dir fonts.scale
es: fonts.scale parece idéntico a fonts.dir... % cp fonts.dir fonts.scale

source: Tell X11 that things have changed % xset fp rehash
es: Dile a X11 que ha habido cambios % xset fp rehash

source: Examine the new font % xfontsel -pattern -type1-*
es: Examina la nueva fuente % xfontsel -pattern -type1-*

source: References: man:xfontsel[1], man:xset[1], The X Windows System in a Nutshell, http://www.ora.com/[O'Reilly & Associates].
es: Referencias: man:xfontsel[1], man:xset[1], The X Windows System in a Nutshell, http://www.ora.com/[O'Reilly & Associates].

source: Using Type 1 Fonts with Ghostscript
es: Uso de tipos Type 1 con Ghostscript

source: Ghostscript references a font via its [.filename]#Fontmap#. This must be modified in a similar way to the X11 [.filename]#fonts.dir#. Ghostscript can use either the [.filename]#.pfa# or the [.filename]#.pfb# format fonts. Using the font from the previous example, here is how to use it with Ghostscript:
es: Ghostscript referencia una fuente mediante su [.filename]#Fontmap#. Éste se debe modificar de una forma similar al [.filename]#fonts.dir# de X11. Ghostscript puede utilizar tanto el formato de fuente [.filename]#.pfa# como el formato [.filename]#.pfb#. Usando la fuente del ejemplo anterior, así es como se utiliza con Ghostscript:

source: Put the font in Ghostscript's font directory % cd /usr/local/share/ghostscript/fonts % ln -s /usr/local/share/fonts/type1/showboat.pfb .
es: Pon la fuente en el directorio de fuentes de Ghostscript % cd /usr/local/share/ghostscript/fonts % ln -s /usr/local/share/fonts/type1/showboat.pfb .

source: Edit Fontmap so Ghostscript knows about the font % cd /usr/local/share/ghostscript/4.01 % ex Fontmap :$a /Showboat (showboat.pfb) ; % From CICA /fonts/atm/showboat . :wq
es: Edita Fontmap para que Ghostscript reconozca la fuente % cd /usr/local/share/ghostscript/4.01 % ex Fontmap :$a /Showboat (showboat.pfb) ; % From CICA /fonts/atm/showboat . :wq

source: Use Ghostscript to examine the font % gs prfont.ps Aladdin Ghostscript 4.01 (1996-7-10) Copyright (C) 1996 Aladdin Enterprises, Menlo Park, CA. All rights reserved. This software comes with NO WARRANTY: see the file PUBLIC for details. Loading Times-Roman font from /usr/local/share/ghostscript/fonts/tir_____.pfb... /1899520 581354 1300084 13826 0 done. GS>Showboat DoFont Loading Showboat font from /usr/local/share/ghostscript/fonts/showboat.pfb... 1939688 565415 1300084 16901 0 done. >>showpage, press <return> to continue<< >>showpage, press <return> to continue<< >>showpage, press <return> to continue<< GS>quit
es: Utiliza Ghostscript para examinar la fuente % gs prfont.ps Aladdin Ghostscript 4.01 (1996-7-10) Copyright (C) 1996 Aladdin Enterprises, Menlo Park, CA. All rights reserved. This software comes with NO WARRANTY: see the file PUBLIC for details. Loading Times-Roman font from /usr/local/share/ghostscript/fonts/tir_____.pfb... /1899520 581354 1300084 13826 0 done. GS>Showboat DoFont Loading Showboat font from /usr/local/share/ghostscript/fonts/showboat.pfb... 1939688 565415 1300084 16901 0 done. >>showpage, press <return> to continue<< >>showpage, press <return> to continue<< >>showpage, press <return> to continue<< GS>quit

source: References: [.filename]#fonts.txt# in the Ghostscript 4.01 distribution
es: Referencias: [.filename]#fonts.txt# in the Ghostscript 4.01 distribution

source: Using Type 1 Fonts with Groff
es: Uso de tipos Type 1 con Groff

source: Now that the new font can be used by both X11 and Ghostscript, how can one use the new font with groff? First of all, since we are dealing with type 1 PostScript(R) fonts, the groff device that is applicable is the _ps_ device. A font file must be created for each font that groff can use. A groff font name is just a file in [.filename]#/usr/share/groff_font/devps#. With our example, the font file could be [.filename]#/usr/share/groff_font/devps/SHOWBOAT#. The file must be created using tools provided by groff.
es: Ahora que la fuente puede ser utiliza tanto por X11 como port Ghostscript, ¿cómo se puede utilizar la nueva fuente con groff? Antes de nada, puesto que estamos tratando con fuentes PostScript(R) tipo 1, el dispositivo groff al que aplica es el dispositivo _ps_. Se debe crear un fichero de fuentes para cada fuente que pueda usar groff. Un nombre de fuente de groff es tan solo un fichero en [.filename]#/usr/share/groff_font/devps#. Con nuestro ejemplo, el fichero de fuentes podría ser [.filename]#/usr/share/groff_font/devps/SHOWBOAT#. El fichero tiene que ser creado utilizando herramientas proporcionadas por groff.

source: The first tool is `afmtodit`. This is not normally installed, so it must be retrieved from the source distribution. I found I had to change the first line of the file, so I did:
es: La primera herramienta es `afmtodit`. No está instalada por defecto, pero puede encontrarla en la distribución original. Descubrí que tenía que cambiar la primera línea del archivo, así que procedí del siguiente modo:

source: This tool will create the groff font file from the metrics file ([.filename]#.afm# suffix.) Continuing with our example:
es: Esta herramienta creará el fichero de fuentes de groff a partir del fichero de métricas (sufijo [.filename]#.afm#.) Siguiendo con nuestro ejemplo:

source: Many .afm files are in Mac format... ^M delimited lines We need to convert them to UNIX(R) style ^J delimited lines % cd /tmp % cat /usr/local/share/fonts/type1/showboat.afm | tr '\015' '\012' >showboat.afm
es: Muchos ficheros .afm están en formato Mac donde ^M delimita lineas Tenemos que convertirlo a estilo UNIX(R) donde ^J delimita lineas % cd /tmp % cat /usr/local/share/fonts/type1/showboat.afm | tr '\015' '\012' >showboat.afm

source: Now create the groff font file % cd /usr/share/groff_font/devps % /tmp/afmtodit.pl -d DESC -e text.enc /tmp/showboat.afm generate/textmap SHOWBOAT
es: Ahora crea el fichero de fuentes de groff % cd /usr/share/groff_font/devps % /tmp/afmtodit.pl -d DESC -e text.enc /tmp/showboat.afm generate/textmap SHOWBOAT

source: The font can now be referenced with the name SHOWBOAT.
es: Ahora se puede hacer referencia al tipo con el nombre SHOWBOAT.

source: If Ghostscript is used to drive the printers on the system, then nothing more needs to be done. However, if true PostScript(R) printers are used, then the font must be downloaded to the printer in order for the font to be used (unless the printer happens to have the showboat font built in or on an accessible font disk.) The final step is to create a downloadable font. The `pfbtops` tool is used to create the [.filename]#.pfa# format of the font, and [.filename]#download# is modified to reference the new font. The [.filename]#download# must reference the internal name of the font. This can easily be determined from the groff font file as illustrated:
es: Si se usa Ghostscript para controlar las impresoras del sistema, entonces no se necesita hacer nada más. Sin embargo, si se utilizan verdaderas impresoreas PostScript(R), entonces la fuente se tiene que descargar a la impresora para que pueda ser utilizada (a menos que resulte que la impresora ya tenga incluida la fuente showboat o esté en un disco de fuentes accesible). El último paso es crear una fuente descargable. La herramienta `pfbtops` se usa para crear el formato [.filename]#.pfa# de la fuente y [.filename]#download# se modifica para referenciar la nueva fuente. [.filename]#download# debe referenciar el nombre interno de la fuente. Éste se puede determinar fácilmente a partir del fichero de fuentes groff como se puede ver:

source: Create the .pfa font file % pfbtops /usr/local/share/fonts/type1/showboat.pfb >showboat.pfa
es: Crear el fichero de fuentes .pfa % pfbtops /usr/local/share/fonts/type1/showboat.pfb >showboat.pfa

source: Of course, if [.filename]#.pfa# is already available, just use a symbolic link to reference it.
es: Por supuesto, si el archivo [.filename]#.pfa# ya existe, simplemente crea un enlace simbólico para referenciarlo.

source: Get the internal font name % fgrep internalname SHOWBOAT internalname Showboat Tell groff that the font must be downloaded % ex download :$a Showboat showboat.pfa . :wq
es: Obtén el nombre interno de la fuente % fgrep internalname SHOWBOAT internalname Showboat Dile a groff que se tiene que descargar la fuente % ex download :$a Showboat showboat.pfa . :wq

source: To test the font:
es: Para probar el tipo:
