Repository: Wang-Yan-Hao/FreeBSD-Online-Document-Editor
Catalog: documentation/content/*/articles/explaining-bsd/_index.po
Languages: es

source: As bugs are found in a RELEASE version, they are fixed, and the fixes are added to the SVN tree. In FreeBSD, the resultant version is called the _STABLE_ version, while in NetBSD and OpenBSD it continues to be called the RELEASE version. Smaller new features can also be added to this branch after a period of test in the CURRENT branch. Security and other important bug fixes are also applied to all supported RELEASE versions.
es: A medida que se van encontrando errores en la versión RELEASE, se corrigen y las correcciones se agregan al árbol del SVN. En FreeBSD la versión resultante se denomina versión _STABLE_, mientras que en NetBSD y OpenBSD continúa siendo la versión RELEASE. También se pueden agregar nuevas funcionalidades más pequeñas a esta rama después de un período de prueba en la rama CURRENT. La seguridad y otras correcciones importantes de errores también se aplican en todas las versiones soportadas de RELEASE.

source: _By contrast, Linux maintains two separate code trees: the stable version and the development version. Stable versions have an even minor version number, such as 2.0, 2.2 or 2.4. Development versions have an odd minor version number, such as 2.1, 2.3 or 2.5. In each case, the number is followed by a further number designating the exact release. In addition, each vendor adds their own userland programs and utilities, so the name of the distribution is also important. Each distribution vendor also assigns version numbers to the distribution, so a complete description might be something like "TurboLinux 6.0 with kernel 2.2.14"_
es: _Linux, en cambio, mantiene dos árboles de código separados: la versión estable y la versión de desarrollo. Las versiones estables añaden un número par de versión, como 2.0, 2.2 ó 2.4. Las versiones de desarrollo añaden un número impar, como en 2.1, 2.3 ó 2.5. En ambos casos a ese número se le añade otro más que indica la versión exacta. Además, cada proveedor agrega sus propios programas de usuario y utilidades, por lo que el nombre de la distribución también es importante. Cada distribuidor además asigna números de versión a la distribución, así pues la descripción completa podría ser algo como "TurboLinux 6.0 with kernel 2.2.14"_

source: What versions of BSD are available?
es: ¿Qué versiones de BSD están disponibles?

source: In contrast to the numerous Linux distributions, there are only four major open source BSDs. Each BSD project maintains its own source tree and its own kernel. In practice, though, there appear to be fewer divergences between the userland code of the projects than there is in Linux.
es: A diferencia de las numerosas distribuciones de Linux, solo hay cuatro BSD principales de código abierto. Cada proyecto BSD mantiene su propio árbol de fuentes y su propio kernel. En la práctica, sin embargo, parece haber menos divergencias entre el código de usuario de los proyectos que en Linux.

source: It is difficult to categorize the goals of each project: the differences are very subjective. Basically,
es: Es difícil categorizar los objetivos de cada proyecto: las diferencias son muy subjetivas. Básicamente,

source: FreeBSD aims for high performance and ease of use by end users, and is a favourite of web content providers. It runs on a link:https://www.FreeBSD.org/platforms/[number of platforms] and has significantly more users than the other projects.
es: FreeBSD aspira a proporcionar alto rendimiento y facilidad de uso para los usuarios finales y es uno de los favoritos para los proveedores de contenido web. Se puede ejecutar en link:https://www.FreeBSD.org/platforms/[diferentes plataformas] y tiene un número significativo mayor de usuarios que otros proyectos.

source: NetBSD aims for maximum portability: "of course it runs NetBSD". It runs on machines from palmtops to large servers, and has even been used on NASA space missions. It is a particularly good choice for running on old non-Intel(R) hardware.
es: NetBSD aspira a ofrecer máxima portabilidad: "por supuesto ejecuta NetBSD". Se puede ejecutar en máquinas desde palmtops a grandes servidores y ha sido utilizado en misiones espaciales de la NASA. Es una opción particularmente buena para ejecutar en hardware antiguo que no sea Intel(R).

source: OpenBSD aims for security and code purity: it uses a combination of the open source concept and rigorous code reviews to create a system which is demonstrably correct, making it the choice of security-conscious organizations such as banks, stock exchanges and US Government departments. Like NetBSD, it runs on a number of platforms.
es: OpenBSD tiene como objetivo la seguridad y la pureza del código: utiliza una combinación del concepto de código abierto y revisiones rigurosas del código para crear un sistema que sea demostrablemente correcto, lo que lo convierte en la elección de organizaciones preocupadas por la seguridad, como bancos, bolsas de valores y departamentos del gobierno de EE. UU. Como NetBSD, se ejecuta en varias plataformas.

source: DragonFlyBSD aims for high performance and scalability under everything from a single-node UP system to a massively clustered system. DragonFlyBSD has several long-range technical goals, but focus lies on providing a SMP-capable infrastructure that is easy to understand, maintain and develop for.
es: DragonFlyBSD tiene como objetivo un alto rendimiento y escalabilidad en todo, desde un sistema UP de un solo nodo hasta un sistema masivamente agrupado. DragonFlyBSD tiene varios objetivos técnicos de largo alcance, pero el enfoque radica en proporcionar una infraestructura compatible con SMP que sea fácil de entender, mantener y desarrollar.

source: There are also two additional BSD UNIX(R) operating systems which are not open source, BSD/OS and Apple's Mac OS(R) X:
es: Hay también dos sistemas operativos BSD UNIX(R) adicionales que no son open source, BSD/OS y el Mac OS(R) X de Apple:

source: BSD/OS was the oldest of the 4.4BSD derivatives. It was not open source, though source code licenses were available at relatively low cost. It resembled FreeBSD in many ways. Two years after the acquisition of BSDi by Wind River Systems, BSD/OS failed to survive as an independent product. Support and source code may still be available from Wind River, but all new development is focused on the VxWorks embedded operating system.
es: BSD/OS fue el más antiguo de los derivados 4.4BSD. No era de código abierto, aunque las licencias de código fuente estaban disponibles a un costo relativamente bajo. Se parecía a FreeBSD en muchos aspectos. Dos años después de la adquisición de BSDi por Wind River Systems, BSD / OS no logró sobrevivir como un producto independiente. El soporte y el código fuente aún pueden estar disponibles en Wind River, pero todo el desarrollo nuevo se centra en el sistema operativo integrado VxWorks.

source: http://www.apple.com/macosx/server/[Mac OS(R) X] is the latest version of the operating system for Apple(R)'s Mac(R) line. The BSD core of this operating system, http://developer.apple.com/darwin/[Darwin], is available as a fully functional open source operating system for x86 and PPC computers. The Aqua/Quartz graphics system and many other proprietary aspects of Mac OS(R) X remain closed-source, however. Several Darwin developers are also FreeBSD committers, and vice-versa.
es: http://www.apple.com/macosx/server/[Mac OS(R) X] es la última versión del sistema operativo para la línea Mac(R) de Apple(R). El núcleo BSD de este sistema operativo, http://developer.apple.com/darwin/[Darwin], está disponible como un sistema operativo open source completamente funcional para ordenadores x86 y PPC. El sistema gráfico Aqua/Quartz y otros muchos aspectos propietarios de Mac OS(R) X sin embargo permanecen cerrados. Varios desarrolladores de Darwin son también committers de FreeBSD y vice versa.

source: How does the BSD license differ from the GNU Public license?
es: ¿En qué se diferencia la licencia BSD de la licencia pública GNU?

source: Linux is available under the http://www.fsf.org/copyleft/gpl.html[GNU General Public License] (GPL), which is designed to eliminate closed source software. In particular, any derivative work of a product released under the GPL must also be supplied with source code if requested. By contrast, the http://www.opensource.org/licenses/bsd-license.html[BSD license] is less restrictive: binary-only distributions are allowed. This is particularly attractive for embedded applications.
es: Linux está disponible bajo la http://www.fsf.org/copyleft/gpl.html[GNU General Public License] (GPL), que está diseñada para eliminar el software de código cerrado. En particular, cualquier trabajo derivado de un producto publicado bajo la GPL también debe suministrarse con el código fuente si se solicita. Por el contrario, la http://www.opensource.org/licenses/bsd-license.html[licencia BSD] es menos restrictiva: permite la distribución en forma exclusivamente binaria. Esto es particularmente atractivo para aplicaciones integradas.

source: What else should I know?
es: ¿Qué más debo saber?

source: Since fewer applications are available for BSD than Linux, the BSD developers created a Linux compatibility package, which allows Linux programs to run under BSD. The package includes both kernel modifications, in order to correctly perform Linux system calls, and Linux compatibility files such as the C library. There is no noticeable difference in execution speed between a Linux application running on a Linux machine and a Linux application running on a BSD machine of the same speed.
es: Dado que hay menos aplicaciones disponibles para BSD que Linux, los desarrolladores de BSD crearon un paquete de compatibilidad con Linux, que permite que los programas de Linux se ejecuten bajo BSD. El paquete incluye modificaciones del kernel para realizar correctamente las llamadas al sistema Linux y archivos de compatibilidad de Linux, como la biblioteca C. No hay una diferencia notable en la velocidad de ejecución entre una aplicación Linux que se ejecuta en una máquina Linux y una aplicación Linux que se ejecuta en una máquina BSD de la misma velocidad.

source: The "all from one supplier" nature of BSD means that upgrades are much easier to handle than is frequently the case with Linux. BSD handles library version upgrades by providing compatibility modules for earlier library versions, so it is possible to run binaries which are several years old with no problems.
es: El modelo "todo del mismo proveedor" de BSD implica que las actualizaciones son mucho más sencillas de gestionar de lo que son con frecuencia en Linux. BSD maneja las actualizaciones de versiones de bibliotecas suministrando módulos de compatibilidad para versiones anteriores, de modo que es posible ejecutar binarios con varios años de antigüedad sin problemas.

source: Which should I use, BSD or Linux?
es: ¿Qué debo usar, BSD o Linux?

source: What does this all mean in practice? Who should use BSD, who should use Linux?
es: ¿Qué significa todo esto en la práctica? ¿Quién debería usar BSD, quién debería usar Linux?

source: This is a very difficult question to answer. Here are some guidelines:
es: Esta es una pregunta muy difícil de responder. Aquí hay algunas pautas:

source: "If it ain't broke, don't fix it": If you already use an open source operating system, and you are happy with it, there is probably no good reason to change.
es: "Si no está roto no lo arregles": Si ya usa un sistema operativo de código abierto y está satisfecho con él, probablemente no haya ninguna buena razón para cambiar.

source: BSD systems, in particular FreeBSD, can have notably higher performance than Linux. But this is not across the board. In many cases, there is little or no difference in performance. In some cases, Linux may perform better than FreeBSD.
es: Los sistemas BSD, en particular FreeBSD, pueden tener un rendimiento notablemente superior al de Linux. Pero esto no es generalizado. En muchos casos, hay poca o ninguna diferencia en el rendimiento. En algunos casos, Linux puede funcionar mejor que FreeBSD.

source: In general, BSD systems have a better reputation for reliability, mainly as a result of the more mature code base.
es: En general, los sistemas BSD tienen una mejor reputación de confiabilidad, principalmente como resultado de una base de código más madura.

source: BSD projects have a better reputation for the quality and completeness of their documentation. The various documentation projects aim to provide actively updated documentation, in many languages, and covering all aspects of the system.
es: Los proyectos BSD gozan de una mejor reputación por la calidad e integridad de su documentación. Los diversos proyectos de documentación tienen como objetivo proporcionar documentación actualizada activamente, en muchos idiomas, y que cubra todos los aspectos del sistema.

source: The BSD license may be more attractive than the GPL.
es: La licencia BSD puede resultar más atractiva que la licencia GPL.

source: BSD can execute most Linux binaries, while Linux can not execute BSD binaries. Many BSD implementations can also execute binaries from other UNIX(R) like systems. As a result, BSD may present an easier migration route from other systems than Linux would.
es: BSD puede ejecutar la mayoría de binarios de Linux, mientras que Linux no puede ejecutar binarios de BSD. Muchas implementaciones de BSD también pueden ejecutar binarios de otros sistemas tipo UNIX(R). Como resultado, BSD podría presentar una ruta de migración desde otros sistemas más sencilla de lo que sería capaz Linux.

source: Who provides support, service, and training for BSD?
es: ¿Quién brinda soporte, servicio y capacitación para BSD?

source: BSDi / http://www.freebsdmall.com[FreeBSD Mall, Inc.] have been providing support contracts for FreeBSD for nearly a decade.
es: BSDi / http://www.freebsdmall.com[FreeBSD Mall, Inc.] ha estado proporcionando contratos de soporte para FreeBSD durante casi una década.

source: In addition, each of the projects has a list of consultants for hire: link:https://www.FreeBSD.org/commercial/consult_bycat/[FreeBSD], http://www.netbsd.org/gallery/consultants.html[NetBSD], and http://www.openbsd.org/support.html[OpenBSD].
es: Además, cada uno de los proyectos tiene una lista de consultores para contratar: link:https://www.FreeBSD.org/commercial/consult_bycat/[FreeBSD], http://www.netbsd.org/gallery/consultants.html[NetBSD], y http://www.openbsd.org/support.html[OpenBSD].
