Repository: Wang-Yan-Hao/FreeBSD-Online-Document-Editor
Catalog: documentation/content/*/articles/explaining-bsd/_index.po
Languages: es

source: Brief explanation about BSD
es: Breve explicación acerca de BSD

source: Explaining BSD
es: Explicando BSD

source: Abstract
es: Resumen

source: In the open source world, the word "Linux" is almost synonymous with "Operating System", but it is not the only open source UNIX(R) operating system.
es: En el mundo open source, la palabra "Linux" es casi un sinónimo de "Sistema Operativo", pero no es el único sistema operativo UNIX(R) open source.

source: So what is the secret? Why is BSD not better known? This white paper addresses these and other questions.
es: Entonces, ¿cuál es el secreto? ¿Por qué BSD no es más conocido? Este documento técnico aborda estas y otras preguntas.

source: Throughout this paper, differences between BSD and Linux will be noted __like this__.
es: A lo largo de este documento, las diferencias entre BSD y Linux serán señaladas __así__.

source: What is BSD?
es: ¿Qué es BSD?

source: BSD stands for "Berkeley Software Distribution". It is the name of distributions of source code from the University of California, Berkeley, which were originally extensions to AT&T's Research UNIX(R) operating system. Several open source operating system projects are based on a release of this source code known as 4.4BSD-Lite. In addition, they comprise a number of packages from other Open Source projects, including notably the GNU project. The overall operating system comprises:
es: BSD significa "Berkeley Software Distribution". Es el nombre de las distribuciones de código fuente de la Universidad de California, Berkeley, que fueron originalmente extensiones al sistema operativo UNIX(R) de investigación de AT&T. Varios proyectos de sistemas operativos open source se basan en una versión de este código fuente conocida como 4.4BSD-Lite. Además, constan de cierto número de paquetes de otros proyectos Open Source, incluyendo especialmente el proyecto GNU. El sistema operativo en general se compone de:

source: The BSD kernel, which handles process scheduling, memory management, symmetric multi-processing (SMP), device drivers, etc.
es: El kernel BSD, que se encarga de la programación de procesos, la gestión de la memoria, el multiprocesamiento simétrico (SMP), los controladores de dispositivos, etc.

source: The C library, the base API for the system.
es: La biblioteca C, la API base del sistema.

source: __The BSD C library is based on code from Berkeley, not the GNU project.__
es: __La librería C de BSD está basada en código de Berkeley, no del proyecto GNU.__

source: Utilities such as shells, file utilities, compilers and linkers.
es: Utilidades como shells, utilidades de archivos, compiladores y enlazadores.

source: __Some of the utilities are derived from the GNU project, others are not.__
es: __Algunas utilidades se derivan del proyecto GNU, otras no.__

source: The X Window system, which handles graphical display.
es: El sistema X Ventanas, que maneja la visualización gráfica.

source: The X Window system used in most versions of BSD is maintained by the http://www.X.org/[X.Org project]. FreeBSD allows the user to choose from a variety of desktop environments, such as Gnome, KDE, or Xfce; and lightweight window managers like Openbox, Fluxbox, or Awesome.
es: El sistema X Window usado por la mayoría de las versiones de BSD es mantenido por el http://www.X.org/[Proyecto X.Org]. FreeBSD permite al usuario escoger de entre una variedad de entornos de escritorio, tales como Gnome, KDE o Xfce; y gestores de ventanas ligeros como Openbox, Fluxbox o Awesome.

source: Many other programs and utilities.
es: Muchos otros programas y utilidades.

source: What, a real UNIX(R)?
es: Cómo, ¿Un UNIX(R) de verdad?

source: The BSD operating systems are not clones, but open source derivatives of AT&T's Research UNIX(R) operating system, which is also the ancestor of the modern UNIX(R) System V. This may surprise you. How could that happen when AT&T has never released its code as open source?
es: Los sistemas operativos BSD no son clones, sino derivados open source del sistema operativo UNIX(R) de investigación de AT&T que es también el ancestro del moderno UNIX(R) System V. Esto podría sorprenderte. ¿Cómo pudo ocurrir esto si AT&T nunca ha liberado su código como open source?

source: It is true that AT&T UNIX(R) is not open source, and in a copyright sense BSD is very definitely _not_ UNIX(R), but on the other hand, AT&T has imported sources from other projects, noticeably the Computer Sciences Research Group (CSRG) of the University of California in Berkeley, CA. Starting in 1976, the CSRG started releasing tapes of their software, calling them _Berkeley Software Distribution_ or __BSD__.
es: Es cierto que UNIX(R) de AT&T no es open source y en el sentido del copyright, BSD definitivamente _no_ es UNIX(R), pero por otro lado, AT&T ha importado las fuentes de otros proyectos, principalmente del Computer Sciences Research Group (CSRG) de la Universidad de California en Berkeley, CA. A comienzos de 1976, el CSRG empezó a liberar cintas con su software, llamándolas _Berkeley Software Distribution_ o __BSD__.

source: Initial BSD releases consisted mainly of user programs, but that changed dramatically when the CSRG landed a contract with the Defense Advanced Research Projects Agency (DARPA) to upgrade the communications protocols on their network, ARPANET. The new protocols were known as the __Internet Protocols__, later _TCP/IP_ after the most important protocols. The first widely distributed implementation was part of 4.2BSD, in 1982.
es: Las versiones iniciales de BSD consistían principalmente en programas de usuario, pero cambió drásticamente cuando el CSRG consiguió un contrato con el Defense Advanced Research Projects Agency (DARPA) para actualizar los protocolos de comunicaciones en su red, ARPANET. Los nuevos protocolos fueron conocidos como __Internet Protocols__, más adelante _TCP/IP_ y más tarde se covertirían en los protocolos más importantes. La primera implementación ampliamente distribuida fue parte de 4.2BSD, en 1982.

source: In the course of the 1980s, a number of new workstation companies sprang up. Many preferred to license UNIX(R) rather than developing operating systems for themselves. In particular, Sun Microsystems licensed UNIX(R) and implemented a version of 4.2BSD, which they called SunOS(TM). When AT&T themselves were allowed to sell UNIX(R) commercially, they started with a somewhat bare-bones implementation called System III, to be quickly followed by System V. The System V code base did not include networking, so all implementations included additional software from the BSD, including the TCP/IP software, but also utilities such as the _csh_ shell and the _vi_ editor. Collectively, these enhancements were known as the __Berkeley Extensions__.
es: A lo largo de los años 1980, surgieron unas cuantas empresas de estaciones de trabajo. Muchas prefirieron licenciar UNIX(R) en lugar de desarrollar sistemas operativos ellos mismos. En particular, Sun Microsystems licenció UNIX(R) e implementó una versión de 4.2BSD que llamaron SunOS(TM). Cuando a AT&T se le permitió vender UNIX(R) comercialmente, empezaron con una implementación algo básica llamada System III, que sería seguida rápidamente por System V. El código base de System V no incluyó código de red, así que todas las implementaciones incluyeron software adicional de BSD, incluyendo el software de TCP/IP, pero también utilidades como el _csh_ shell y el editor _vi_. De forma colectiva, estas mejoras fueron conocidas como __Berkeley Extensions__.

source: The BSD tapes contained AT&T source code and thus required a UNIX(R) source license. By 1990, the CSRG's funding was running out, and it faced closure. Some members of the group decided to release the BSD code, which was Open Source, without the AT&T proprietary code. This finally happened with the __Networking Tape 2__, usually known as __Net/2__. Net/2 was not a complete operating system: about 20% of the kernel code was missing. One of the CSRG members, William F. Jolitz, wrote the remaining code and released it in early 1992 as __386BSD__. At the same time, another group of ex-CSRG members formed a commercial company called http://www.bsdi.com/[Berkeley Software Design Inc.] and released a beta version of an operating system called http://www.bsdi.com/[BSD/386], which was based on the same sources. The name of the operating system was later changed to BSD/OS.
es: Las cintas de BSD contenían código fuente de AT&T y por lo tanto requerían una licencia de fuentes de UNIX(R). En 1990, la financiación del CSRG se terminó y se enfrentó a su cierre. Algunos miembros del grupo decidieron liberar el código BSD, que era Open Source, sin el código propietario de AT&T. Esto sucedió finalmente con el __Networking Tape 2__, habitualmente conocido como __Net/2__. Net/2 no era un sistema operativo completo: faltaba alrededor del 20% del código del núcleo. Uno de los miembros del CSRG, William F. Jolitz, escribió el código que faltaba y lo liberó a comienzos de 1992 como __386BSD__. Al mismo tiempo, otro grupo de antiguos miembros del CSRG formó una compañía comercial llamada http://www.bsdi.com/[Berkeley Software Design Inc.] y liberó una versión beta de un sistema operativo llamado http://www.bsdi.com/[BSD/386] que estaba basada en las mismas fuentes. El nombre del sistema operativo se cambió posteriormente a BSD/OS.

source: 386BSD never became a stable operating system. Instead, two other projects split off from it in 1993: http://www.NetBSD.org/[NetBSD] and link:https://www.FreeBSD.org/[FreeBSD]. The two projects originally diverged due to differences in patience waiting for improvements to 386BSD: the NetBSD people started early in the year, and the first version of FreeBSD was not ready until the end of the year. In the meantime, the code base had diverged sufficiently to make it difficult to merge. In addition, the projects had different aims, as we will see below. In 1996, http://www.OpenBSD.org/[OpenBSD] split off from NetBSD, and in 2003, http://www.dragonflybsd.org/[DragonFlyBSD] split off from FreeBSD.
es: 386BSD nunca se convirtió en un sistema operativo estable. En su lugar, dos proyectos se separaron de él en 1993: http://www.NetBSD.org/[NetBSD] y link:https://www.FreeBSD.org/[FreeBSD]. Los dos proyectos divergieron originalmente debido a diferencias en el nivel de paciencia esperando las mejoras de 386BSD: la gente de NetBSD empezó a comienzos de año y la primera versión de FreeBSD no estuvo lista hasta final de año. Mientras tanto, el código base había divergido lo suficiente como para hacer difícil su unión. Además los proyectos tenían distintos objetivos, como veremos abajo. En 1996, http://www.OpenBSD.org/[OpenBSD] se escindió de NetBSD, y en 2003, http://www.dragonflybsd.org/[DragonFlyBSD] se escindió de FreeBSD.

source: Why is BSD not better known?
es: ¿Por qué BSD no es más conocido?

source: For a number of reasons, BSD is relatively unknown:
es: Por varias razones, BSD es relativamente desconocido:

source: The BSD developers are often more interested in polishing their code than marketing it.
es: Los desarrolladores de BSD suelen estar más interesados en pulir su código que en comercializarlo.

source: Much of Linux's popularity is due to factors external to the Linux projects, such as the press, and to companies formed to provide Linux services. Until recently, the open source BSDs had no such proponents.
es: Gran parte de la popularidad de Linux se debe a factores externos a los proyectos de Linux, como la prensa, y a las empresas formadas para proporcionar servicios de Linux. Hasta hace poco, los BSD de código abierto no tenían tales defensores.

source: In 1992, AT&T sued http://www.bsdi.com/[BSDI], the vendor of BSD/386, alleging that the product contained AT&T-copyrighted code. The case was settled out of court in 1994, but the spectre of the litigation continues to haunt people. In March 2000 an article published on the web claimed that the court case had been "recently settled".
es: En 1992, AT&T demandó a http://www.bsdi.com/[BSDI], el fabricante de BSD/386, alegando que el código contenía código con derechos de AT&T. El caso se resolvió en los tribunales en 1994, pero el espectro del litigio continúa persiguiendo a la gente. En marzo de 2000 un artículo publicado en la web declaraba que el caso judicial se había "resuelto recientemente".

source: One detail that the lawsuit did clarify is the naming: in the 1980s, BSD was known as "BSD UNIX(R)". With the elimination of the last vestige of AT&T code from BSD, it also lost the right to the name UNIX(R). Thus you will see references in book titles to "the 4.3BSD UNIX(R) operating system" and "the 4.4BSD operating system".
es: Un detalle que clarificó el proceso judicial fue el nombre: en la década de 1980, BSD era conocido como "BSD UNIX(R)". Con la eliminación de los últimos vestigios de código de AT&T de BSD, también perdió el derecho al nombre UNIX(R). Por lo tanto verás referencias en títulos de libros a "el sistema operativo 4.3BSD UNIX(R)" y "el sistema operativo 4.4.BSD".

source: Comparing BSD and Linux
es: Comparando BSD y Linux

source: So what is really the difference between, say, Debian Linux and FreeBSD? For the average user, the difference is surprisingly small: Both are UNIX(R) like operating systems. Both are developed by non-commercial projects (this does not apply to many other Linux distributions, of course). In the following section, we will look at BSD and compare it to Linux. The description applies most closely to FreeBSD, which accounts for an estimated 80% of the BSD installations, but the differences from NetBSD, OpenBSD and DragonFlyBSD are small.
es: Entonces ¿cuál es la diferencia entre, digamos, Debian Linux y FreeBSD? Para el usuario medio, la diferencia es sorprendentemente pequeña: Ambos son sistemas operativos tipo UNIX(R). Ambos son desarrollados por proyectos no comerciales (esto no se aplica a muchas otras distribuciones Linux, por supuesto). En la siguiente sección, miraremos a BSD y lo compararemos con Linux. La descripción es más cercana a FreeBSD, que cuenta con un total estimado del 80% de las instalaciones de BSD, pero las diferencias con NetBSD, OpenBSD y DragonFlyBSD son pequeñas.

source: Who owns BSD?
es: ¿Quién es dueño de BSD?

source: No one person or corporation owns BSD. It is created and distributed by a community of highly technical and committed contributors all over the world. Some of the components of BSD are Open Source projects in their own right and managed by different project maintainers.
es: Ninguna persona o corporación es propietaria de BSD. Es creado y distribuido por una comunidad de colaboradores altamente técnicos y comprometidos en todo el mundo. Algunos de los componentes de BSD son proyectos de código abierto por derecho propio y gestionados por diferentes encargados de mantenimiento de proyectos.

source: How is BSD developed and updated?
es: ¿Cómo se desarrolla y actualiza BSD?

source: The BSD kernels are developed and updated following the Open Source development model. Each project maintains a publicly accessible _source tree_ which contains all source files for the project, including documentation and other incidental files. Users can obtain a complete copy of any version.
es: Los kernel de BSD se desarrollan y actualizan siguiendo el modelo de desarrollo de código abierto. Cada proyecto mantiene un _árbol de código fuente_ de acceso público que contiene todos los archivos del proyecto, incluida la documentación y otros ficheros relacionados. Los usuarios pueden obtener una copia completa de cualquier versión.

source: A large number of developers worldwide contribute to improvements to BSD. They are divided into three kinds:
es: Una gran cantidad de desarrolladores en todo el mundo contribuyen a las mejoras de BSD. Se dividen en tres tipos:

source: _Contributors_ write code or documentation. They are not permitted to commit (add code) directly to the source tree. In order for their code to be included in the system, it must be reviewed and checked in by a registered developer, known as a __committer__.
es: _Contributors (colaboradores)_ escriben código o documentación. No tienen permitido hacer commit (añadir código) directamente al árbol de fuentes. Para que su código sea incluido en el sistema, tiene que ser revisado y comprobado por un desarrollador registrado, conocimo como __committer__.

source: _Committers_ are developers with write access to the source tree. In order to become a committer, an individual must show ability in the area in which they are active.
es: _Committers_ son desarrolladores con permiso de escritura al árbol de fuentes. Para convertirse en un committer, una persona debe mostrar habilidad en el área en el que está activa.

source: It is at the individual committer's discretion whether they should obtain authority before committing changes to the source tree. In general, an experienced committer may make changes which are obviously correct without obtaining consensus. For example, a documentation project committer may correct typographical or grammatical errors without review. On the other hand, developers making far-reaching or complicated changes are expected to submit their changes for review before committing them In extreme cases, a core team member with a function such as Principal Architect may order that changes be removed from the tree, a process known as _backing out_. All committers receive mail describing each individual commit, so it is not possible to commit secretly.
es: Depende del criterio individual de cada committer cuándo pedir autorización antes de hacer cambios en el árbol de fuentes. En general, un committer experimentado puede realizar cambios que obviamente son correctos sin obtener consenso. Por ejemplo, un committer que trabaje en un proyecto de documentación puede corregir errores tipográficos o gramaticales sin necesidad de revisión. Por otra parte, se espera que los desarrolladores que pretendan realizar cambios de gran calado o complicados envíen sus cambios para que sean revisados antes de ser incluidos. En casos extremos un miembro del core team con una función como la del Principal Architect puede ordenar que los cambios sean retirados del árbol, es lo que llamamos _backing out_. Todos los committers reciben un correo electrónico que describe cada commit, por lo que no es posible hacer un commit en secreto.

source: The _Core team_. FreeBSD and NetBSD each have a core team which manages the project. The core teams developed in the course of the projects, and their role is not always well-defined. It is not necessary to be a developer in order to be a core team member, though it is normal. The rules for the core team vary from one project to the other, but in general they have more say in the direction of the project than non-core team members have.
es: El _Core team_. Tanto FreeBSD como NetBSD disponen de un core team que administra el proyecto. Los core teams dirigen el rumbo de los proyectos pero sus funciones no siempre están claras. No es necesario ser desarrollador para ser un miembro del core team pero suele ser lo habitual. Las normas del core team varían de un proyecto a otro, pero en general tienen más voz en la dirección del proyecto que los miembros del equipo que no son del Core.

source: This arrangement differs from Linux in a number of ways:
es: Esta disposición se diferencia de Linux en varias formas:

source: No one person controls the content of the system. In practice, this difference is overrated, since the Principal Architect can require that code be backed out, and even in the Linux project several people are permitted to make changes.
es: Nadie controla el contenido del sistema. En la práctica, esta diferencia está sobrevalorada, ya que el arquitecto principal puede requerir que el código se restituya, e incluso en el proyecto de Linux se permite a varias personas realizar cambios.

source: On the other hand, there _is_ a central repository, a single place where you can find the entire operating system sources, including all older versions.
es: Por otro lado, _hay_ un repositorio central, un único lugar donde puedes encontrar las fuentes del sistema operativo completo, incluyendo todas las versiones antiguas.

source: BSD projects maintain the entire "Operating System", not only the kernel. This distinction is only marginally useful: neither BSD nor Linux is useful without applications. The applications used under BSD are frequently the same as the applications used under Linux.
es: Los proyectos BSD mantienen todo el "Sistema Operativo", no solo el kernel. Esta distinción tiene una utilidad marginal: ni BSD ni Linux son útiles sin aplicaciones. Las aplicaciones utilizadas en BSD son con frecuencia las mismas que las utilizadas en Linux.

source: As a result of the formalized maintenance of a single SVN source tree, BSD development is clear, and it is possible to access any version of the system by release number or by date. SVN also allows incremental updates to the system: for example, the FreeBSD repository is updated about 100 times a day. Most of these changes are small.
es: Como resultado del mantenimiento formalizado de un único árbol de fuentes SVN, el desarrollo de BSD es claro y es posible acceder a cualquier versión del sistema por número de versión o por fecha. SVN también permite actualizaciones incrementales del sistema: por ejemplo, el repositorio de FreeBSD se actualiza unas 100 veces al día. La mayoría de estos cambios son pequeños.

source: BSD releases
es: Versiones de BSD

source: FreeBSD, NetBSD and OpenBSD provide the system in three different "releases". As with Linux, releases are assigned a number such as 1.4.1 or 3.5. In addition, the version number has a suffix indicating its purpose:
es: FreeBSD, NetBSD y OpenBSD proporcionan el sistema en tres "versiones" diferentes. Al igual que Linux, a los lanzamientos se les asigna un número como 1.4.1 ó 3.5. Además, el número de versión tiene un sufijo que indica su propósito:

source: The development version of the system is called _CURRENT_. FreeBSD assigns a number to CURRENT, for example FreeBSD 5.0-CURRENT. NetBSD uses a slightly different naming scheme and appends a single-letter suffix which indicates changes in the internal interfaces, for example NetBSD 1.4.3G. OpenBSD does not assign a number ("OpenBSD-current"). All new development on the system goes into this branch.
es: La versión del sistema que está en desarrollo se llama _CURRENT_. FreeBSD asigna números a CURRENT, por ejemplo FreeBSD 5.0-CURRENT. NetBSD utiliza un esquena de nombrado ligeramente diferente y añade un sufijo de una única letra que indica cambios en los interfaces internos, por ejemplo NetBSD 1.4.3G. OpenBSD no asigna un número ("OpenBSD-current"). Todo el desarrollo nuevo del sistema se realiza en esta rama.

source: At regular intervals, between two and four times a year, the projects bring out a _RELEASE_ version of the system, which is available on CD-ROM and for free download from FTP sites, for example OpenBSD 2.6-RELEASE or NetBSD 1.4-RELEASE. The RELEASE version is intended for end users and is the normal version of the system. NetBSD also provides _patch releases_ with a third digit, for example NetBSD 1.4.2.
es: A intervalos regulares, entre dos y cuatro veces al año, el proyecto saca una versión _RELEASE_ del sistema, que está disponible en CD-ROM y libre para descargar desde los sitios FTP, por ejemplo OpenBSD 2.6-RELEASE o NetBSD 1.4-RELEASE. La versión RELEASE está pensada para usuarios finales y es la versión normal del sistema. NetBSD también proporciona _patch releases_ con un tercer dígito, por ejemplo NetBSD 1.4.2.
