Repository: Wang-Yan-Hao/FreeBSD-Online-Document-Editor
Catalog: documentation/content/*/articles/bsdl-gpl/_index.po
Languages: es

source: Non-profits should participate in Open Source projects when possible. To minimize software engineering problems, such as mixing code under different licenses, BSD-style licenses should be encouraged. Being leery of the GPL should particularly be the case with non-profits that interact with the developing world. In some locales where application of law becomes a costly exercise, the simplicity of the new BSD license, as compared to the GPL, may be of considerable advantage.
es: Las organizaciones sin ánimo de lucro deben participar en proyectos de código abierto cuando sea posible. Para reducir los problemas de ingeniería del software, tales como mezclar código bajo diferentes licencias, se deben fomentar las licencias de estilo BSD. Desconfiar de la licencia GPL debería ser particularmente el caso de las organizaciones sin ánimo de lucro que interactúan con el mundo del desarrollo. En algunos lugares donde la aplicación de la ley se convierte en un ejercicio costoso, la simplicidad de la nueva licencia BSD, en comparación con la GPL, puede ser una ventaja considerable.

source: Conclusion
es: Conclusión

source: In contrast to the GPL, which is designed to prevent the proprietary commercialization of Open Source code, the BSD license places minimal restrictions on future behavior. This allows BSD code to remain Open Source or become integrated into commercial solutions, as a project's or company's needs change. In other words, the BSD license does not become a legal time-bomb at any point in the development process.
es: A diferencia de la GPL, que está diseñada para evitar la comercialización patentada de código fuente abierto, la licencia BSD impone restricciones mínimas sobre el comportamiento futuro. Esto permite que el código BSD siga siendo de código abierto o se integre en soluciones comerciales, a medida que cambian las necesidades de un proyecto o empresa. En otras palabras, la licencia BSD no se convierte en una bomba de tiempo legal en ningún momento del proceso de desarrollo.

source: In addition, since the BSD license does not come with the legal complexity of the GPL or LGPL licenses, it allows developers and companies to spend their time creating and promoting good code rather than worrying if that code violates licensing.
es: Además, dado que la licencia BSD no viene con la complejidad legal de las licencias GPL o LGPL, permite a los desarrolladores y empresas dedicar su tiempo a crear y promover un buen código en lugar de preocuparse si ese código viola la licencia.

source: Bibliographical References
es: Referencias bibliográficas

source: [[[three,3]]] Open Source: the Unauthorized White Papers, Donald K. Rosenberg, IDG Books, 2000. Quotes are from page 114, "Effects of the GNU GPL".
es: [[[three,3]]] Open Source: the Unauthorized White Papers, Donald K. Rosenberg, IDG Books, 2000. Las citas son de la página 114, "Effects of the GNU GPL".

source: [[[four,4]]] In the "What License to Use?" section of http://www.oreilly.com/catalog/opensources/book/brian.html
es: [[[four,4]]] En la sección "What License to Use?" de http://www.oreilly.com/catalog/opensources/book/brian.html

source: This whitepaper is a condensation of an original work available at http://alumni.cse.ucsc.edu/~brucem/open_source_license.htm
es: Este informe es un compendio del trabajo original disponible en http://alumni.cse.ucsc.edu/~brucem/open_source_license.htm
