Repository: Wang-Yan-Hao/FreeBSD-Online-Document-Editor
Catalog: documentation/content/*/articles/bsdl-gpl/_index.po
Languages: es

source: Why you should use a BSD style license for your Open Source Project
es: Por qué debería utilizar una licencia de estilo BSD para su proyecto de Código Abierto

source: Introduction
es: Introducción

source: This document makes a case for using a BSD style license for software and data; specifically it recommends using a BSD style license in place of the GPL. It can also be read as a BSD versus GPL Open Source License introduction and summary.
es: Este documento justifica el uso de una licencia de estilo BSD para software y datos; específicamente recomienda utilizar una licencia de estilo BSD en lugar de la GPL. También se puede leer como una introducción y resumen de la licencia de código abierto BSD versus GPL.

source: Very Brief Open Source History
es: Breve historia del Código Abierto

source: Long before the term "Open Source" was used, software was developed by loose associations of programmers and freely exchanged. Starting in the early 1950's, organizations such as http://www.share.org[SHARE] and http://www.decus.org[DECUS] developed much of the software that computer hardware companies bundled with their hardware offerings. At that time computer companies were in the hardware business; anything that reduced software cost and made more programs available made the hardware companies more competitive.
es: Mucho antes de que el término "Open Source" fuera utilizado, el software era desarrollado por diferentes asociaciones de programadores y compartido libremente. A comienzos de los años 50, organizaciones como http://www.share.org[SHARE] y http://www.decus.org[DECUS] desarrollaron mucho del software que las compañías de hardware incluían en sus ofertas de equipos. En aquella época las compañías informáticas estaban en el negocio del hardware; cualquier cosa que redujera el coste del software e hiciera los programas más disponibles hacía que las compañías de hardware fueran más competitivas.

source: This model changed in the 1960's. In 1965 ADR developed the first licensed software product independent of a hardware company. ADR was competing against a free IBM package originally developed by IBM customers. ADR patented their software in 1968. To stop sharing of their program, they provided it under an equipment lease in which payment was spread over the lifetime of the product. ADR thus retained ownership and could control resale and reuse.
es: Este modelo cambió en los años 60. En 1965 la ADR desarrolló el primer producto de software con licencia que era independiente de una compañía de hardware. ADR estaba compitiendo con un paquete gratuito de IBM desarrollado originalmente por los clientes de IBM. ADR patentó su software en 1968. Para dejar de compartir programas, los suministraron bajo un contrato de arrendamiento del equipo en el que el pago se extendía durante toda la vida del producto. ADR retenía así la propiedad y podía controlar la reventa y la reutilización.

source: In 1969 the US Department of Justice charged IBM with destroying businesses by bundling free software with IBM hardware. As a result of this suit, IBM unbundled its software; that is, software became independent products separate from hardware.
es: En 1969, el Departamento de Justicia de los Estados Unidos acusó a IBM de destruir negocios al combinar software libre con su hardware. Como resultado de este demanda, IBM quitó su software; es decir, el software se convirtió en un producto independiente y separado del hardware.

source: In 1968 Informatics introduced the first commercial killer-app and rapidly established the concept of the software product, the software company, and very high rates of return. Informatics developed the perpetual license which is now standard throughout the computer industry, wherein ownership is never transferred to the customer.
es: En 1968, la informática introdujo la primera aplicación asesina comercial y estableció rápidamente el concepto del producto de software, la empresa de software y tasas de retorno muy altas. La informática desarrolló la licencia perpetua que ahora es estándar en toda la industria informática, en la que la propiedad nunca se transfiere al cliente.

source: Unix from a BSD Licensing Perspective
es: Unix desde una perspectiva de Licencia de BSD

source: AT&T, who owned the original Unix implementation, was a publicly regulated monopoly tied up in anti-trust court; it was legally unable to sell a product into the software market. It was, however, able to provide it to academic institutions for the price of media.
es: AT&T, que era propietario de la implementación original de Unix, era un monopolio regulado públicamente vinculado a un tribunal antimonopolio; legalmente no podía vender un producto en el mercado de software. Sin embargo, pudo proporcionarlo a instituciones académicas por el precio de los medios.

source: Universities rapidly adopted Unix after an OS conference publicized its availability. It was extremely helpful that Unix ran on the PDP-11, a very affordable 16-bit computer, and was coded in a high-level language that was demonstrably good for systems programming. The DEC PDP-11 had, in effect, an open hardware interface designed to make it easy for customers to write their own OS, which was common. As DEC founder Ken Olsen famously proclaimed, "software comes from heaven when you have good hardware".
es: Las universidades adoptaron rápidamente Unix después de que una conferencia sobre sistemas operativos anunciara su disponibilidad. Fue extremadamente útil que Unix se ejecutara en el PDP-11, una computadora de 16 bits muy asequible, y estuviera codificado en un lenguaje de alto nivel que era demostrablemente bueno para la programación de sistemas. El DEC PDP-11 tenía, en efecto, una interfaz de hardware abierta diseñada para facilitar a los clientes la escritura de su propio sistema operativo, lo cual era común. Como proclamó el fundador de DEC, Ken Olsen, "el software viene del cielo cuando tienes un buen hardware".

source: Unix author Ken Thompson returned to his alma mater, University of California Berkeley (UCB), in 1975 and taught the kernel line-by-line. This ultimately resulted in an evolving system known as BSD (Berkeley Standard Distribution). UCB converted Unix to 32-bits, added virtual memory, and implemented the version of the TCP/IP stack upon which the Internet was essentially built. UCB made BSD available for the cost of media, under what became known as "the BSD license". A customer purchased Unix from AT&T and then ordered a BSD tape from UCB.
es: El autor de Unix Ken Thompson regresó a su alma máter, la Universidad de California Berkeley (UCB), en 1975 y enseñó el núcleo línea por línea. Esto finalmente resultó en un sistema en evolución conocido como BSD (Distribución estándar de Berkeley). UCB convirtió Unix a 32 bits, agregó memoria virtual e implementó la versión de la pila TCP / IP sobre la que se construyó Internet esencialmente. UCB puso a disposición BSD por el costo de los medios, bajo lo que se conoció como "la licencia BSD". Un cliente compraba Unix a AT&T y después encargaba una cinta con BSD a la UCB.

source: In the mid-1980s a government anti-trust case against AT&T ended with the break-up of AT&T. AT&T still owned Unix and was now able to sell it. AT&T embarked on an aggressive licensing effort and most commercial Unixes of the day became AT&T-derived.
es: A mediados de la década de 1980, un caso antimonopolio del gobierno contra AT&T terminó con su desintegración. AT&T todavía era dueña de Unix y podía venderlo. AT&T se embarcó en un esfuerzo agresivo de licenciamiento y la mayoría de los sistemas Unix comerciales de la época llegaron a ser derivados de los de AT&T.

source: In the early 1990's AT&T sued UCB over license violations related to BSD. UCB discovered that AT&T had incorporated, without acknowledgment or payment, many improvements due to BSD into AT&T's products, and a lengthy court case, primarily between AT&T and UCB, ensued. During this period some UCB programmers embarked on a project to rewrite any AT&T code associated with BSD. This project resulted in a system called BSD 4.4-lite (lite because it was not a complete system; it lacked 6 key AT&T files).
es: Al principio de los 90 AT&T demandó a UCB por violaciones de la licencia relacionada con BSD. La UCB descubrió que AT&T había incorporado, sin conocimiento ni retribución, muchas mejoras de BSD en los productos de AT&T, y tuvo lugar un largo proceso judicial, principalmente entre AT&T y la UCB. Durante este periodo algunos de los programadores de la UCB se embarcaron en un proyecto para reescribir cualquier código de AT&T asociado con BSD. Este proyecto resultó en un sistema llamado BSD 4.4-lite ("lite" o ligero, porque no era un sistema completo; carecía de 6 archivos clave de AT&T).

source: A lengthy series of articles published slightly later in Dr. Dobbs magazine described a BSD-derived 386 PC version of Unix, with BSD-licensed replacement files for the 6 missing 4.4 lite files. This system, named 386BSD, was due to ex-UCB programmer William Jolitz. It became the original basis of all the PC BSDs in use today.
es: Una larga serie de artículos publicados un poco más tarde en la revista Dr. Dobbs describe una versión 386 de Unix para PC derivada de BSD, con archivos de reemplazo con licencia BSD para los 6 archivos 4.4 lite que faltan. Este sistema, llamado 386BSD, se debió al ex programador de UCB William Jolitz. Se convirtió en la base original de todos los BSD de PC que se utilizan en la actualidad.

source: In the mid 1990s, Novell purchased AT&T's Unix rights and a (then secret) agreement was reached to terminate the lawsuit. UCB soon terminated its support for BSD.
es: A mediados de la década de 1990, Novell compró AT&T Se llegó a los derechos Unix y a un acuerdo (entonces secreto) para terminar la demanda. UCB pronto terminó su apoyo a BSD.

source: The Current State of FreeBSD and BSD Licenses
es: El estado actual de las licencias FreeBSD y BSD

source: The so-called http://www.opensource.org/licenses/bsd-license.php[new BSD license] applied to FreeBSD within the last few years is effectively a statement that you can do anything with the program or its source, but you do not have any warranty and none of the authors has any liability (basically, you cannot sue anybody). This new BSD license is intended to encourage product commercialization. Any BSD code can be sold or included in proprietary products without any restrictions on the availability of your code or your future behavior.
es: La llamada http://www.opensource.org/licenses/bsd-license.php[nueva licencia de BSD] aplicada a FreeBSD en los últimos años es efectivamente una declaración de que puedes hacer cualquier cosa con el programa o su fuente, pero no tienes ninguna garantía y ninguno de los autores tiene ninguna responsabilidad (básicamente, no puedes demandar a nadie). Esta nueva licencia BSD está destinada a fomentar la comercialización de productos. Cualquier código BSD puede venderse o incluirse en productos patentados sin ninguna restricción sobre la disponibilidad de su código o su comportamiento futuro.

source: Do not confuse the new BSD license with "public domain". While an item in the public domain is also free for all to use, it has no owner.
es: No confunda la nueva licencia BSD con "dominio públic". Mientras que en el dominio público un apartado establece el uso libre para todos, no establece propietario.

source: The origins of the GPL
es: Los orígenes de la GPL

source: While the future of Unix had been so muddled in the late 1980s and early 1990s, the GPL, another development with important licensing considerations, reached fruition.
es: Si bien el futuro de Unix había sido tan confuso a fines de la década de 1980 y principios de la de 1990, la GPL, otro desarrollo con importantes consideraciones de licencia, alcanzó sus frutos.

source: Richard Stallman, the developer of Emacs, was a member of the staff at MIT when his lab switched from home-grown to proprietary systems. Stallman became upset when he found that he could not legally add minor improvements to the system. (Many of Stallman's co-workers had left to form two companies based on software developed at MIT and licensed by MIT; there appears to have been disagreement over access to the source code for this software). Stallman devised an alternative to the commercial software license and called it the GPL, or "GNU Public License". He also started a non-profit foundation, the http://www.fsf.org[Free Software Foundation] (FSF), which intended to develop an entire operating system, including all associated software, that would not be subject to proprietary licensing. This system was called GNU, for "GNU is Not Unix".
es: Richard Stallman, el desarrollador de Emacs, era miembro del personal del MIT cuando su laboratorio cambió de sistemas propios a propietarios. Stallman se molestó cuando descubrió que legalmente no podía agregar mejoras menores al sistema. (Muchos de los compañeros de trabajo de Stallman se habían marchado para formar dos empresas basadas en software desarrollado en MIT y con licencia de MIT; parece que hubo desacuerdo sobre el acceso al código fuente de este software). Stallman ideó una alternativa a la licencia de software comercial y la llamó GPL o "Licencia pública GNU". También inició una fundación sin fines de lucro, la http://www.fsf.org[Free Software Foundation] (FSF), que pretendía desarrollar un sistema operativo completo, incluidos todos software asociado, que no estaría sujeto a licencias de propiedad. Este sistema se llamó GNU, porque "GNU no es Unix".

source: The GPL was designed to be the antithesis of the standard proprietary license. To this end, any modifications that were made to a GPL program were required to be given back to the GPL community (by requiring that the source of the program be available to the user) and any program that used or linked to GPL code was required to be under the GPL. The GPL was intended to keep software from becoming proprietary. As the last paragraph of the GPL states:
es: La GPL fue diseñada para ser la antítesis de la licencia propietaria estándar. Con este fin, se requería que cualquier modificación que se hiciera a un programa GPL se devolviera a la comunidad GPL (requiriendo que el código fuente del programa estuviera disponible para el usuario) y se requería cualquier programa que usara o vinculara el código GPL estar bajo la GPL. La GPL estaba destinada a evitar que el software se convirtiera en propietario. Como dice el último párrafo de la GPL:

source: "This General Public License does not permit incorporating your program into proprietary programs."<<one>>
es: "Esta Licencia Pública General no permite la incorporación de tu programa en programas propietarios."<<one>>

source: The http://www.opensource.org/licenses/gpl-license.php[GPL] is a complex license so here are some rules of thumb when using the GPL:
es: La http://www.opensource.org/licenses/gpl-license.php[GPL] es una licencia compleja así que aquí hay algunas reglas básicas cuando se utiliza la GPL:

source: you can charge as much as you want for distributing, supporting, or documenting the software, but you cannot sell the software itself.
es: puede cobrar tanto como desee por distribuir, respaldar o documentar el software, pero no puede vender el software en sí.

source: the rule-of-thumb states that if GPL source is required for a program to compile, the program must be under the GPL. Linking statically to a GPL library requires a program to be under the GPL.
es: la regla general establece que si se requiere la fuente GPL para que un programa se compile, el programa debe estar bajo la GPL. La vinculación estática a una biblioteca GPL requiere que un programa esté bajo la GPL.

source: the GPL requires that any patents associated with GPLed software must be licensed for everyone's free use.
es: la GPL requiere que cualquier patente asociada con el software con licencia GPL debe tener licencia para uso gratuito de todos.

source: simply aggregating software together, as when multiple programs are put on one disk, does not count as including GPLed programs in non-GPLed programs.
es: simplemente agregar software, como cuando se colocan varios programas en un disco, no cuenta como la inclusión de programas con GPL en programas sin GPL.

source: output of a program does not count as a derivative work. This enables the gcc compiler to be used in commercial environments without legal problems.
es: la salida de un programa no cuenta como trabajo derivado. Esto permite utilizar el compilador gcc en entornos comerciales sin problemas legales.

source: since the Linux kernel is under the GPL, any code statically linked with the Linux kernel must be GPLed. This requirement can be circumvented by dynamically linking loadable kernel modules. This permits companies to distribute binary drivers, but often has the disadvantage that they will only work for particular versions of the Linux kernel.
es: dado que el kernel de Linux está bajo la GPL, cualquier código enlazado estáticamente con el kernel de Linux debe ser GPL. Este requisito se puede eludir vinculando dinámicamente módulos del kernel cargables. Esto permite a las empresas distribuir controladores binarios, pero a menudo tiene la desventaja de que solo funcionarán para versiones particulares del kernel de Linux.

source: Due in part to its complexity, in many parts of the world today the legalities of the GPL are being ignored in regard to Linux and related software. The long-term ramifications of this are unclear.
es: Debido en parte a su complejidad, en muchas partes del mundo hoy en día se ignoran las legalidades de la GPL con respecto a Linux y software relacionado. Las ramificaciones a largo plazo de esto no están claras.

source: The origins of Linux and the LGPL
es: Los orígenes de Linux y de la licencia GPL

source: While the commercial Unix wars raged, the Linux kernel was developed as a PC Unix clone. Linus Torvalds credits the existence of the GNU C compiler and the associated GNU tools for the existence of Linux. He put the Linux kernel under the GPL.
es: Mientras se desarrollaban las guerras comerciales de Unix, el kernel de Linux se desarrolló como un clon de Unix para PC. Linus Torvalds acredita la existencia del compilador GNU C y las herramientas GNU asociadas para la existencia de Linux. Puso el kernel de Linux bajo la GPL.

source: Remember that the GPL requires anything that statically links to any code under the GPL also be placed under the GPL. The source for this code must thus be made available to the user of the program. Dynamic linking, however, is not considered a violation of the GPL. Pressure to put proprietary applications on Linux became overwhelming. Such applications often must link with system libraries. This resulted in a modified version of the GPL called the http://www.opensource.org/licenses/lgpl-license.php[LGPL] ("Library", since renamed to "Lesser", GPL). The LGPL allows proprietary code to be linked to the GNU C library, glibc. You do not have to release the source code which has been dynamically linked to an LGPLed library.
es: Recuerde que la licencia GPL requiere que cualquier cosa que se enlace estáticamente a cualquier código bajo la licencia GPL también se pondrá bajo la licencia GPL. El código fuente debe estar disponible para el usuario del programa. El enlace dinámico, sin embargo, no se considera una violación de la licencia GPL. La presión para poner aplicaciones propietarias en Linux llegó a ser abrumadora. Tales aplicaciones deben enlazarse a menudo con las bibliotecas del sistema. Esto resultó en una versión modificada de la GPL denominada http://www.opensource.org/licenses/lgpl-license.php[LGPL] ("Library", rebautizada como menor ("Lesser"), GPL). La licencia LGPL permite al código propietario estar enlazado a la biblioteca C de GNU, glibc. No hay que liberar el código fuente que ha sido enlazado dinámicamente a una biblioteca bajo una licencia LGPL.

source: If you statically link an application with glibc, such as is often required in embedded systems, you cannot keep your application proprietary, that is, the source must be released. Both the GPL and LGPL require any modifications to the code directly under the license to be released.
es: Si enlaza estáticamente una aplicación con glibc, como suele ser necesario en los sistemas integrados, no puede mantener la propiedad de la aplicación, es decir, debe liberar la fuente. Tanto la GPL como la LGPL requieren cualquier modificación al código directamente bajo la licencia para ser liberadas.

source: Open Source licenses and the Orphaning Problem
es: Las licencias de Código Abierto y el Problema de la Orfandad

source: One of the serious problems associated with proprietary software is known as "orphaning". This occurs when a single business failure or change in a product strategy causes a huge pyramid of dependent systems and companies to fail for reasons beyond their control. Decades of experience have shown that the momentary size or success of a software supplier is no guarantee that their software will remain available, as current market conditions and strategies can change rapidly.
es: Uno de los graves problemas asociados con el software privativo se conoce como "orfandad". Esto ocurre cuando un solo fallo de negocio o un cambio en la estrategia del producto hace que una enorme pirámide de sistemas y empresas dependientes falle por razones que están más allá de su control. Décadas de experiencia han mostrado que el tamaño o éxito momentáneos de un proveedor de software no es garantía de que su software permanecerá disponible, ya que las condiciones y estrategias actuales del mercado pueden cambiar rápidamente.

source: The GPL attempts to prevent orphaning by severing the link to proprietary intellectual property.
es: La licencia GPL intenta prevenir la orfandad mediante el corte del vínculo con la propiedad intelectual privativa.

source: A BSD license gives a small company the equivalent of software-in-escrow without any legal complications or costs. If a BSD-licensed program becomes orphaned, a company can simply take over, in a proprietary manner, the program on which they are dependent. An even better situation occurs when a BSD code-base is maintained by a small informal consortium, since the development process is not dependent on the survival of a single company or product line. The survivability of the development team when they are mentally in the zone is much more important than simple physical availability of the source code.
es: Una licencia BSD le da a una pequeña empresa el equivalente al software en custodia sin complicaciones ni costos legales. Si un programa con licencia BSD queda huérfano, una empresa puede simplemente hacerse cargo, de manera patentada, del programa del que depende. Una situación aún mejor ocurre cuando un pequeño consorcio informal mantiene una base de código BSD, ya que el proceso de desarrollo no depende de la supervivencia de una sola empresa o línea de productos. La capacidad de supervivencia del equipo de desarrollo cuando están mentalmente en la zona es mucho más importante que la simple disponibilidad física del código fuente.

source: What a license cannot do
es: Lo que no puede hacer una licencia
