Repository: Wang-Yan-Hao/FreeBSD-Online-Document-Editor
Catalog: documentation/content/*/articles/bsdl-gpl/_index.po
Languages: es

source: No license can guarantee future software availability. Although a copyright holder can traditionally change the terms of a copyright at anytime, the presumption in the BSD community is that such an attempt simply causes the source to fork.
es: Ninguna licencia puede garantizar la disponibilidad futura del software. Aunque un titular de derechos de autor tradicionalmente puede cambiar los términos de un derecho de autor en cualquier momento, la presunción en la comunidad de BSD es que tal intento simplemente hace que la fuente se bifurque.

source: The GPL explicitly disallows revoking the license. It has occurred, however, that a company (Mattel) purchased a GPL copyright (cphack), revoked the entire copyright, went to court, and prevailed <<two>>. That is, they legally revoked the entire distribution and all derivative works based on the copyright. Whether this could happen with a larger and more dispersed distribution is an open question; there is also some confusion regarding whether the software was really under the GPL.
es: La GPL no permite explícitamente revocar la licencia. Sin embargo, ha ocurrido que una empresa (Mattel) compró un copyright GPL (cphack), revocó todo el copyright, acudió a los tribunales y prevaleció <<two>>. Es decir, revocaron legalmente toda la distribución y todos los trabajos derivados basados en los derechos de autor. Si esto podría suceder con una distribución más amplia y dispersa es una pregunta abierta; También existe cierta confusión sobre si el software estaba realmente bajo la GPL.

source: In another example, Red Hat purchased Cygnus, an engineering company that had taken over development of the FSF compiler tools. Cygnus was able to do so because they had developed a business model in which they sold support for GNU software. This enabled them to employ some 50 engineers and drive the direction of the programs by contributing the preponderance of modifications. As Donald Rosenberg states "projects using licenses like the GPL...live under constant threat of having someone take over the project by producing a better version of the code and doing it faster than the original owners." <<three>>
es: En otro ejemplo, Red Hat compró Cygnus, una empresa de ingeniería que se había hecho cargo del desarrollo de las herramientas del compilador FSF. Cygnus pudo hacerlo porque habían desarrollado un modelo de negocio en el que vendían soporte para software GNU. Esto les permitió emplear a unos 50 ingenieros e impulsar la dirección de los programas contribuyendo con la preponderancia de las modificaciones. Como afirma Donald Rosenberg "los proyectos que utilizan licencias como la GPL ... viven bajo la amenaza constante de que alguien se haga cargo del proyecto produciendo una mejor versión del código y haciéndolo más rápido que los propietarios originales". <<three>>

source: GPL Advantages and Disadvantages
es: Ventajas y Desventajas de la licencia GPL

source: A common reason to use the GPL is when modifying or extending the gcc compiler. This is particularly apt when working with one-off specialty CPUs in environments where all software costs are likely to be considered overhead, with minimal expectations that others will use the resulting compiler.
es: Una razón común para usar la GPL es cuando se modifica o se extiende el compilador gcc. Esto es particularmente adecuado cuando se trabaja con CPU especiales únicas en entornos donde es probable que todos los costos de software se consideren gastos generales, con expectativas mínimas de que otros usen el compilador resultante.

source: The GPL is also attractive to small companies selling CDs in an environment where "buy-low, sell-high" may still give the end-user a very inexpensive product. It is also attractive to companies that expect to survive by providing various forms of technical support, including documentation, for the GPLed intellectual property world.
es: La GPL también es atractiva para las pequeñas empresas que venden CD en un entorno en el que "comprar barato, vender caro" puede ofrecer al usuario final un producto muy económico. También es atractivo para las empresas que esperan sobrevivir proporcionando diversas formas de soporte técnico, incluida la documentación, para el mundo de la propiedad intelectual con GPL.

source: A less publicized and unintended use of the GPL is that it is very favorable to large companies that want to undercut software companies. In other words, the GPL is well suited for use as a marketing weapon, potentially reducing overall economic benefit and contributing to monopolistic behavior.
es: Un uso menos publicitado y no intencionado de la GPL es que es muy favorable para las grandes empresas que quieren socavar a las empresas de software. En otras palabras, la GPL es adecuada para su uso como arma de marketing, reduciendo potencialmente el beneficio económico general y contribuyendo al comportamiento monopolístico.

source: The GPL can present a real problem for those wishing to commercialize and profit from software. For example, the GPL adds to the difficulty a graduate student will have in directly forming a company to commercialize his research results, or the difficulty a student will have in joining a company on the assumption that a promising research project will be commercialized.
es: La GPL puede presentar un problema real para quienes deseen comercializar y beneficiarse del software. Por ejemplo, la GPL se suma a la dificultad que tendrá un estudiante de posgrado para formar directamente una empresa para comercializar sus resultados de investigación, o la dificultad que tendrá un estudiante para unirse a una empresa en el supuesto de que se comercializará un proyecto de investigación prometedor.

source: For those who must work with statically-linked implementations of multiple software standards, the GPL is often a poor license, because it precludes using proprietary implementations of the standards. The GPL thus minimizes the number of programs that can be built using a GPLed standard. The GPL was intended to not provide a mechanism to develop a standard on which one engineers proprietary products. (This does not apply to Linux applications because they do not statically link, rather they use a trap-based API.)
es: Para aquellos que deben trabajar con implementaciones vinculadas estáticamente de múltiples estándares de software, la GPL es a menudo una licencia deficiente, porque excluye el uso de implementaciones propietarias de los estándares. Por tanto, la GPL minimiza el número de programas que se pueden construir utilizando un estándar GPL. La GPL no tenía la intención de proporcionar un mecanismo para desarrollar un estándar sobre el cual se diseñan productos patentados. (Esto no se aplica a las aplicaciones de Linux porque no se enlazan estáticamente, sino que utilizan una API basada en trampas.)

source: The GPL attempts to make programmers contribute to an evolving suite of programs, then to compete in the distribution and support of this suite. This situation is unrealistic for many required core system standards, which may be applied in widely varying environments which require commercial customization or integration with legacy standards under existing (non-GPL) licenses. Real-time systems are often statically linked, so the GPL and LGPL are definitely considered potential problems by many embedded systems companies.
es: La GPL intenta hacer que los programadores contribuyan a un conjunto de programas en evolución y luego competir en la distribución y el soporte de este conjunto. Esta situación no es realista para muchos estándares de sistemas centrales requeridos, que pueden aplicarse en entornos muy variados que requieren personalización comercial o integración con estándares heredados bajo licencias existentes (no GPL). Los sistemas en tiempo real a menudo están vinculados estáticamente, por lo que muchas empresas de sistemas integrados consideran definitivamente problemas potenciales a la GPL y la LGPL.

source: The GPL is an attempt to keep efforts, regardless of demand, at the research and development stages. This maximizes the benefits to researchers and developers, at an unknown cost to those who would benefit from wider distribution.
es: La GPL es un intento de mantener los esfuerzos, independientemente de la demanda, en las etapas de investigación y desarrollo. Esto maximiza los beneficios para los investigadores y desarrolladores, a un costo desconocido para aquellos que se beneficiarían de una distribución más amplia.

source: The GPL was designed to keep research results from transitioning to proprietary products. This step is often assumed to be the last step in the traditional technology transfer pipeline and it is usually difficult enough under the best of circumstances; the GPL was intended to make it impossible.
es: La GPL fue diseñada para evitar que los resultados de la investigación se conviertan en productos patentados. A menudo se asume que este paso es el último en el proceso de transferencia de tecnología tradicional y, por lo general, es bastante difícil en las mejores circunstancias; la GPL estaba destinada a hacerlo imposible.

source: BSD Advantages
es: Ventajas de BSD

source: A BSD style license is a good choice for long duration research or other projects that need a development environment that:
es: Una licencia de estilo BSD es una buena opción para investigaciones de larga duración u otros proyectos que necesitan un entorno de desarrollo que:

source: has near zero cost
es: Tiene un coste casi nulo

source: will evolve over a long period of time
es: evolucionará durante un largo período de tiempo

source: permits anyone to retain the option of commercializing final results with minimal legal issues.
es: permite que cualquiera conserve la opción de comercializar los resultados finales con un mínimo de problemas legales.

source: This final consideration may often be the dominant one, as it was when the Apache project decided upon its license:
es: Esta consideración final a menudo puede ser la dominante, como lo fue cuando el proyecto Apache decidió su licencia:

source: "This type of license is ideal for promoting the use of a reference body of code that implements a protocol for common service. This is another reason why we choose it for the Apache group - many of us wanted to see HTTP survive and become a true multiparty standard, and would not have minded in the slightest if Microsoft or Netscape choose to incorporate our HTTP engine or any other component of our code into their products, if it helped further the goal of keeping HTTP common... All this means that, strategically speaking, the project needs to maintain sufficient momentum, and that participants realize greater value by contributing their code to the project, even code that would have had value if kept proprietary."
es: "Este tipo de licencia es ideal para promover el uso de un código de referencia que implemente un protocolo para un servicio común. Esta es otra razón por la cual la escogimos para el grupo Apache - muchos de nosotros queríamos ver a HTTP sobrevivir y convertirse en un verdadero estándar comunitario, y no nos habría importado en lo más mínimo si Microsoft o Netscape hubieran elegido incorporar nuestro motor HTTP o cualquier otro componente de nuestro código en sus productos, si esto ayudaba además al objetivo de mantener a HTTP comunitario... Todo esto significa que, estratégicamente hablando, el proyecto necesita mantener el impulso suficiente, y que los participantes se den cuenta del valor de contribuir con su código al proyecto, incluso código que hubiera tenido valor si se mantuviera como propietario."

source: Developers tend to find the BSD license attractive as it keeps legal issues out of the way and lets them do whatever they want with the code. In contrast, those who expect primarily to use a system rather than program it, or expect others to evolve the code, or who do not expect to make a living from their work associated with the system (such as government employees), find the GPL attractive, because it forces code developed by others to be given to them and keeps their employer from retaining copyright and thus potentially "burying" or orphaning the software. If you want to force your competitors to help you, the GPL is attractive.
es: Los desarrolladores tienden a encontrar atractiva la licencia BSD, ya que evita los problemas legales y les permite hacer lo que quieran con el código. En contraste, aquellos que esperan principalmente usar un sistema en lugar de programarlo, o esperan que otros desarrollen el código, o que no esperan ganarse la vida con su trabajo asociado con el sistema (como los empleados del gobierno), encuentran la GPL atractivo, porque obliga a que se les proporcione código desarrollado por otros y evita que su empleador retenga los derechos de autor y, por lo tanto, potencialmente "entierre" o deje huérfano al software. Si quiere obligar a sus competidores a que le ayuden, la GPL es atractiva.

source: A BSD license is not simply a gift. The question "why should we help our competitors or let them steal our work?" comes up often in relation to a BSD license. Under a BSD license, if one company came to dominate a product niche that others considered strategic, the other companies can, with minimal effort, form a mini-consortium aimed at reestablishing parity by contributing to a competitive BSD variant that increases market competition and fairness. This permits each company to believe that it will be able to profit from some advantage it can provide, while also contributing to economic flexibility and efficiency. The more rapidly and easily the cooperating members can do this, the more successful they will be. A BSD license is essentially a minimally complicated license that enables such behavior.
es: Una licencia BSD no es simplemente un regalo. La cuestión "¿por qué deberíamos ayudar a nuestros competidores o dejarles que roben nuestro trabajo?" surge frecuentemente en relación con la licencia BSD. Bajo una licencia BSD, si una compañia llega a dominar un nicho de mercado que otras consideran estratégico, las otras compañías pueden, con un mínimo esfuerzo, formar un mini-consorcio destinado a restablecer la igualdad contribuyendo a una variante de BSD competitiva que aumente la competencia y la equidad en el mercado. Esto permite a cada compañía tener confianza en que podrá beneficiarse de algunas ventajas, a la vez que contribuyen a la flexibilidad y eficiencia económica. Cuanto más rápido y fácil puedan hacerlo los miembros que están cooperando, más éxito tendrán. Una licencia BSD es esencialmente una licencia mínimamente complicada que permite tal comportamiento.

source: A key effect of the GPL, making a complete and competitive Open Source system widely available at cost of media, is a reasonable goal. A BSD style license, in conjunction with ad-hoc-consortiums of individuals, can achieve this goal without destroying the economic assumptions built around the deployment-end of the technology transfer pipeline.
es: Un efecto clave de la GPL, hacer que un sistema de código abierto completo y competitivo esté ampliamente disponible al costo de los medios, es un objetivo razonable. Una licencia de estilo BSD, junto con consorcios ad-hoc de individuos, puede lograr este objetivo sin destruir los supuestos económicos construidos en torno al final de la implementación del proceso de transferencia de tecnología.

source: Specific Recommendations for using a BSD license
es: Recomendaciones específicas para usar una licencia BSD

source: The BSD license is preferable for transferring research results in a way that will widely be deployed and most benefit an economy. As such, research funding agencies, such as the NSF, ONR and DARPA, should encourage in the earliest phases of funded research projects, the adoption of BSD style licenses for software, data, results, and open hardware. They should also encourage formation of standards based around implemented Open Source systems and ongoing Open Source projects.
es: La licencia BSD es preferible para transferir los resultados de la investigación de una manera que se implementará ampliamente y beneficiará más a la economía. Como tal, las agencias de financiación de la investigación, como NSF, ONR y DARPA, deberían fomentar en las primeras fases de los proyectos de investigación financiados la adopción de licencias de estilo BSD para software, datos, resultados y hardware abierto. También deberían fomentar la formación de estándares basados en sistemas de código abierto implementados y proyectos de código abierto en curso.

source: Government policy should minimize the costs and difficulties in moving from research to deployment. When possible, grants should require results to be available under a commercialization friendly BSD style license.
es: La política gubernamental debe minimizar los costos y las dificultades para pasar de la investigación a la implementación. Cuando sea posible, las subvenciones deben exigir que los resultados estén disponibles bajo una licencia de estilo BSD compatible con la comercialización.

source: In many cases, the long-term results of a BSD style license more accurately reflect the goals proclaimed in the research charter of universities than what occurs when results are copyrighted or patented and subject to proprietary university licensing. Anecdotal evidence exists that universities are financially better rewarded in the long run by releasing research results and then appealing to donations from commercially successful alumni.
es: En muchos casos, los resultados a largo plazo de una licencia de estilo BSD reflejan con mayor precisión los objetivos proclamados en la carta de investigación de las universidades que lo que ocurre cuando los resultados están protegidos por derechos de autor o patentados y sujetos a una licencia universitaria de propiedad. Existen pruebas anecdóticas de que las universidades son mejor recompensadas financieramente a largo plazo al publicar los resultados de la investigación y luego apelar a las donaciones de los ex alumnos comercialmente exitosos.

source: Companies have long recognized that the creation of de facto standards is a key marketing technique. The BSD license serves this role well, if a company really has a unique advantage in evolving the system. The license is legally attractive to the widest audience while the company's expertise ensures their control. There are times when the GPL may be the appropriate vehicle for an attempt to create such a standard, especially when attempting to undermine or co-opt others. The GPL, however, penalizes the evolution of that standard, because it promotes a suite rather than a commercially applicable standard. Use of such a suite constantly raises commercialization and legal issues. It may not be possible to mix standards when some are under the GPL and others are not. A true technical standard should not mandate exclusion of other standards for non-technical reasons.
es: Las empresas han reconocido desde hace mucho tiempo que la creación de estándares de facto es una técnica de marketing clave. La licencia BSD cumple bien este papel, si una empresa realmente tiene una ventaja única en la evolución del sistema. La licencia es legalmente atractiva para la audiencia más amplia, mientras que la experiencia de la empresa asegura su control. Hay ocasiones en las que la GPL puede ser el vehículo adecuado para intentar crear tal estándar, especialmente cuando se intenta socavar o cooptar a otros. La GPL, sin embargo, penaliza la evolución de ese estándar, porque promueve una suite en lugar de un estándar comercialmente aplicable. El uso de una suite de este tipo plantea constantemente problemas legales y de comercialización. Puede que no sea posible mezclar estándares cuando algunos están bajo la GPL y otros no. Una verdadera norma técnica no debería exigir la exclusión de otras normas por razones no técnicas.

source: Companies interested in promoting an evolving standard, which can become the core of other companies' commercial products, should be wary of the GPL. Regardless of the license used, the resulting software will usually devolve to whoever actually makes the majority of the engineering changes and most understands the state of the system. The GPL simply adds more legal friction to the result.
es: Las empresas interesadas en promover un estándar en evolución, que puede convertirse en el núcleo de los productos comerciales de otras empresas, deben tener cuidado con la GPL. Independientemente de la licencia utilizada, el software resultante generalmente se transferirá a quien realmente realice la mayoría de los cambios de ingeniería y entienda el estado del sistema. La GPL simplemente agrega más fricción legal al resultado.

source: Large companies, in which Open Source code is developed, should be aware that programmers appreciate Open Source because it leaves the software available to the employee when they change employers. Some companies encourage this behavior as an employment perk, especially when the software involved is not directly strategic. It is, in effect, a front-loaded retirement benefit with potential lost opportunity costs but no direct costs. Encouraging employees to work for peer acclaim outside the company is a cheap portable benefit a company can sometimes provide with near zero downside.
es: Las grandes empresas, en las que se desarrolla código Open Source, deben ser conscientes de que los programadores aprecian Open Source porque deja el software disponible para el empleado cuando cambia de empleador. Algunas empresas fomentan este comportamiento como una ventaja laboral, especialmente cuando el software involucrado no es directamente estratégico. En efecto, es un beneficio de jubilación anticipado con posibles costos de oportunidad perdida pero sin costos directos. Alentar a los empleados a trabajar para obtener el reconocimiento de sus compañeros fuera de la empresa es un beneficio portátil económico que una empresa a veces puede ofrecer con un inconveniente cercano a cero.

source: Small companies with software projects vulnerable to orphaning should attempt to use the BSD license when possible. Companies of all sizes should consider forming such Open Source projects when it is to their mutual advantage to maintain the minimal legal and organization overheads associated with a true BSD-style Open Source project.
es: Las empresas pequeñas con proyectos de software que sean vulnerables a quedar huérfanos deben intentar usar la licencia BSD cuando sea posible. Las empresas, sean del tamaño que sean, deben considerar la creación de proyectos de Código Abierto cuando les convenga mantener los gastos legales y de organización asociados con un verdadero proyecto de código abierto de estilo BSD.
