Repository: Wang-Yan-Hao/FreeBSD-Online-Document-Editor
Catalog: documentation/content/*/articles/freebsd-questions/_index.po
Languages: es

source: I've just got the FreeBSD 2.1.5 CDROM from Walnut Creek, and I'm having a lot of difficulty installing it. I have a 66 MHz 486 with 16 MB of memory and an Adaptec 1540A SCSI board, a 1.2GB Quantum Fireball disk and a Toshiba 3501XA CDROM drive. The installation works just fine, but when I try to reboot the system, I get the message Missing Operating System.
es: Acabo de hacerme con el CDROM de FreeBSD 2.1.5 de Walnut Creek y estoy teniendo muchos problemas para instalarlo. Tengo un 486 a 66 MHz con 16 MB de memoria y una placa Adaptec 1540A SCSI, un disco Quantum Fireball de 1.2GB y una unidad de CDROM Toshiba 3501XA. La instalación funciona bien, pero cuando trato de reiniciar el sistema obtengo el mensaje "Missing Operating System".

source: How to Follow up to a Question
es: Cómo dar seguimiento a una pregunta

source: Often you will want to send in additional information to a question you have already sent. The best way to do this is to reply to your original message. This has three advantages:
es: A menudo, querrás enviar información adicional a una pregunta que ya hayas enviado. La mejor forma de hacerlo es responder a tu mensaje original. Esto tiene tres ventajas:

source: You include the original message text, so people will know what you are talking about. Do not forget to trim unnecessary text out, though.
es: Incluyes el texto del mensaje original, para que la gente sepa de qué estás hablando. Sin embargo, no olvides recortar el texto innecesario.

source: The text in the subject line stays the same (you did remember to put one in, did you not?). Many mailers will sort messages by subject. This helps group messages together.
es: El texto en la línea de asunto permanece igual (te acordase de poner uno, ¿no es así?). Muchos remitentes clasifican los mensajes por asunto. Esto ayuda a agrupar los mensajes.

source: The message reference numbers in the header will refer to the previous message. Some mailers, such as http://www.mutt.org/[mutt], can _thread_ messages, showing the exact relationships between the messages.
es: Los números de referencia del mensaje harán referencia al mensaje anterior. Algunas aplicaciones de correo, como http://www.mutt.org/[mutt], pueden crear _hilos_ de mensajes, mostrando las relaciones exactas entre los mensajes.

source: How to Answer a Question
es: Cómo Responder a una Pregunta

source: Before you answer a question to FreeBSD-questions, consider:
es: Antes de responder una pregunta a FreeBSD-questions, considera:

source: A lot of the points on submitting questions also apply to answering questions. Read them.
es: Muchos de los puntos sobre el envío de preguntas también se aplican a la respuesta a preguntas. Léelos.

source: Has somebody already answered the question? The easiest way to check this is to sort your incoming mail by subject: then (hopefully) you will see the question followed by any answers, all together.
es: ¿Alguien ya ha respondido la pregunta? La forma más fácil de verificar esto es ordenar su correo entrante por asunto: luego (con suerte) verás la pregunta seguida de las respuestas, todas juntas.

source: If somebody has already answered it, it does not automatically mean that you should not send another answer. But it makes sense to read all the other answers first.
es: Si alguien ya la ha respondido, no significa automáticamente que no debas enviar otra respuesta. Pero tiene sentido leer primero todas las demás respuestas.

source: Do you have something to contribute beyond what has already been said? In general, "Yeah, me too" answers do not help much, although there are exceptions, like when somebody is describing a problem they are having, and they do not know whether it is their fault or whether there is something wrong with the hardware or software. If you do send a "me too" answer, you should also include any further relevant information.
es: ¿Tienes algo que aportar más allá de lo que ya se ha dicho? En general, las respuestas del tipo "Sí, yo también" no ayudan mucho, aunque hay excepciones, como cuando alguien está describiendo un problema que está teniendo, y no sabe si es culpa suya o si hay algo mal con el hardware o software. Si vas a enviar una respuesta de tipo "yo también", debes incluir otra información relevante.

source: Are you sure you understand the question? Very frequently, the person who asks the question is confused or does not express themselves very well. Even with the best understanding of the system, it is easy to send a reply which does not answer the question. This does not help: you will leave the person who submitted the question more frustrated or confused than ever. If nobody else answers, and you are not too sure either, you can always ask for more information.
es: ¿Estás seguro de que comprende la pregunta? Con mucha frecuencia, la persona que hace la pregunta se confunde o no se expresa muy bien. Incluso con la mejor comprensión del sistema, es fácil enviar una respuesta que no responde a la pregunta. Esto no ayuda: dejará a la persona que envió la pregunta más frustrada o confundida que nunca. Si nadie más responde y tú tampoco estás muy seguro, siempre puedes solicitar más información.

source: Are you sure your answer is correct? If not, wait a day or so. If nobody else comes up with a better answer, you can still reply and say, for example, "I do not know if this is correct, but since nobody else has replied, why don't you try replacing your ATAPI CDROM with a frog?".
es: ¿Estás seguro de que tu respuesta es correcta? Si no, espera un día o así. Si a nadie más se le ocurre una respuesta mejor, aún puedes responder y decir, por ejemplo, "No sé si esto es correcto, pero como nadie más ha respondido, ¿por qué no intentas reemplazar tu CDROM ATAPI con una rana?".

source: Unless there is a good reason to do otherwise, reply to the sender and to FreeBSD-questions. Many people on the FreeBSD-questions are "lurkers": they learn by reading messages sent and replied to by others. If you take a message which is of general interest off the list, you are depriving these people of their information. Be careful with group replies; lots of people send messages with hundreds of CCs. If this is the case, be sure to trim the Cc: lines appropriately.
es: A menos que haya una buena razón para hacer lo contrario, responde al remitente y a FreeBSD-questions. Muchas personas en FreeBSD-questions son "lurkers": aprenden leyendo mensajes enviados y respondidos por otras personas. Si quitas de la lista un mensaje que es de interés general, estás privando a estas personas de su información. Ten cuidado con las respuestas grupales; mucha gente envía mensajes con cientos de CC. Si es así, asegúrate de reducir las líneas Cc: de forma apropiada.

source: Include relevant text from the original message. Trim it to the minimum, but do not overdo it. It should still be possible for somebody who did not read the original message to understand what you are talking about.
es: Incluye texto relevante del mensaje original. Córtalo al mínimo, pero no se exceda. Aún debe ser posible que alguien que no haya leído el mensaje original entienda de lo que estás hablando.

source: Use some technique to identify which text came from the original message, and which text you add. I personally find that prepending "`>`" to the original message works best. Leaving white space after the "`> ;`" and leave empty lines between your text and the original text both make the result more readable.
es: Usa alguna técnica para identificar qué texto venía del mensaje original y qué texto añadiste tú. Personalmente creo que utilizar "`>`" como prefijo en el mensaje original es lo que mejor funciona. Dejar espacios en blanco después de "`> ;`" y dejar líneas en blanco entre tu texto y el texto original también hacen el resultado más legible.

source: Put your response in the correct place (after the text to which it replies). It is very difficult to read a thread of responses where each reply comes before the text to which it replies.
es: Pon tu respuesta en el lugar correcto (después del texto al que responde). Es muy difícil leer un hilo de respuestas donde cada respuesta viene antes del texto al que responde.

source: Most mailers change the subject line on a reply by prepending a text such as "Re: ". If your mailer does not do it automatically, you should do it manually.
es: La mayoría de las aplicaciones de correo cambian la línea del asunto en una respuesta poniendo como prefijo un texto como "Re: ". Si tu aplicación de correo no hace esto automáticamente, deberías hacerlo manualmente.

source: If the submitter did not abide by format conventions (lines too long, inappropriate subject line) _please_ fix it. In the case of an incorrect subject line (such as "HELP!!??"), change the subject line to (say) "Re: Difficulties with sync PPP (was: HELP!!??)". That way other people trying to follow the thread will have less difficulty following it.
es: Si el remitente no ha seguido las convenciones de formato (líneas muy largas, línea de asunto inapropiada) _por favor_ arréglalo. En el caso de una linea de asunto incorrecta (como "AYUDA!!??"), cambia la linea de asunto a algo como: "Re: Dificultades sincronizando PPP (was: AYUDA!!??)". De este modo otra gente que está intentando seguir el hilo lo tendrá menos difícil.

source: In such cases, it is appropriate to say what you did and why you did it, but try not to be rude. If you find you can not answer without being rude, do not answer.
es: En tales casos, es apropiado decir lo que hiciste y por qué lo hiciste, pero trata de no ser grosero. Si encuentras que no puedes responder sin ser grosero, no respondas.

source: If you just want to reply to a message because of its bad format, just reply to the submitter, not to the list. You can just send him this message in reply, if you like.
es: Si solo deseas responder a un mensaje debido a su formato incorrecto, simplemente responde al remitente, no a la lista. Puedes enviarle este mensaje en respuesta, si lo deseas.
