Repository: Wang-Yan-Hao/FreeBSD-Online-Document-Editor
Catalog: documentation/content/*/articles/freebsd-questions/_index.po
Languages: es

source: How to get Best Results from the FreeBSD-questions Mailing List
es: Cómo obtener los mejores resultados de la lista de correo de preguntas de FreeBSD

source: Abstract
es: Resumen

source: This document provides useful information for people looking to prepare an e-mail to the FreeBSD-questions mailing list. Advice and hints are given that will maximize the chance that the reader will receive useful replies.
es: Este documento proporciona información útil para las personas que buscan preparar un correo electrónico para la lista de correo de preguntas de FreeBSD. Se dan consejos y sugerencias que maximizarán la posibilidad de que el lector reciba respuestas útiles.

source: This document is regularly posted to the FreeBSD-questions mailing list.
es: Este documento se publica regularmente en la lista de correo FreeBSD-questions.

source: Introduction
es: Introducción

source: `FreeBSD-questions` is a mailing list maintained by the FreeBSD project to help people who have questions about the normal use of FreeBSD. Another group, `FreeBSD-hackers`, discusses more advanced questions such as future development work.
es: `FreeBSD-questions` es una lista de correo mantenida por el proyecto FreeBSD para ayudar a las personas que tienen preguntas sobre el uso cotidiano de FreeBSD. Otro grupo, `FreeBSD-hackers`, discute preguntas más avanzadas, como el trabajo a desarrollar en el futuro.

source: The term "hacker" has nothing to do with breaking into other people's computers. The correct term for the latter activity is "cracker", but the popular press has not found out yet. The FreeBSD hackers disapprove strongly of cracking security, and have nothing to do with it. For a longer description of hackers, see Eric Raymond's http://www.catb.org/~esr/faqs/hacker-howto.html[How To Become A Hacker]
es: El término "hacker" no tiene nada que ver con entrar en los ordenadores de los demás. El término correcto para esto último es "cracker", pero la prensa popular no se ha enterado todavía. Los hackers de FreeBSD se oponen enérgicamente a romper la seguridad de un sistema y no tienen nada que ver con ello. Para una descripción más larga de los hackers, http://www.catb.org/~esr/faqs/hacker-howto.html[How To Become A Hacker] por Eric Raymond.

source: This is a regular posting aimed to help both those seeking advice from FreeBSD-questions (the "newcomers"), and also those who answer the questions (the "hackers").
es: Esta es una publicación regular destinada a ayudar tanto a aquellos que buscan consejos en la lista FreeBSD-questions (los "recién llegados"), como a aquellos que responden a las preguntas (los "hackers").

source: Inevitably there is some friction, which stems from the different viewpoints of the two groups. The newcomers accuse the hackers of being arrogant, stuck-up, and unhelpful, while the hackers accuse the newcomers of being stupid, unable to read plain English, and expecting everything to be handed to them on a silver platter. Of course, there is an element of truth in both these claims, but for the most part these viewpoints come from a sense of frustration.
es: Inevitablemente, existe cierta fricción, que se deriva de los diferentes puntos de vista de los dos grupos. Los recién llegados acusan a los hackers de ser arrogantes, engreídos e inútiles, mientras que los hackers acusan a los recién llegados de ser estúpidos, incapaces de leer un inglés sencillo y esperar que todo les sea entregado en bandeja de plata. Por supuesto, hay un elemento de verdad en ambas afirmaciones, pero en su mayor parte estos puntos de vista provienen de una sensación de frustración.

source: In this document, I would like to do something to relieve this frustration and help everybody get better results from FreeBSD-questions. In the following section, I recommend how to submit a question; after that, we will look at how to answer one.
es: En este documento, me gustaría hacer algo para aliviar esta frustración y ayudar a todos a obtener mejores resultados de las preguntas de FreeBSD. En la siguiente sección, recomiendo cómo enviar una pregunta; después de eso, veremos cómo responder a una.

source: How to Subscribe to FreeBSD-questions
es: Cómo Suscribirse a FreeBSD-questions

source: FreeBSD-questions is a mailing list, so you need mail access. Point your WWW browser to the {freebsd-questions}. In the section titled "Subscribe or unsubscribe online" fill in the "Your email address" field and hit "Subscribe". Or send an email to freebsd-questions+subscribe@freebsd.org.
es: FreeBSD-questions es una lista de correo así que necesitas acceso a correo electrónico. En tu navegador, ve a {freebsd-questions}. En la sección titulada "Subscribe or unsubscribe online" rellena el campo "Your email address" y presiona "Subscribe". O envía un correo a freebsd-questions+subscribe@freebsd.org.

source: You will receive a confirmation message from mlmmj; follow the included instructions to complete your subscription.
es: Recibirás un mensaje de confirmación de lmmj; sigue las instrucciones que se incluyen para completar tu suscripción.

source: How to Unsubscribe from FreeBSD-questions
es: Cómo cancelar la suscripción a FreeBSD-questions

source: Point your WWW browser to the {freebsd-questions}. In the section titled "Subscribe or unsubscribe online" fill in the "Your email address" field and hit "Unsubscribe". Or send an email to freebsd-questions+unsubscribe@freebsd.org.
es: En tu navegador, ve a {freebsd-questions}. En la sección titulada "Subscribine or unsubscribe online" rellena el campo "Your email address" y presiona "Unsubscribe". O envía un email a freebsd-questions+unsubscribe@freebsd.org.

source: A confirmation message will be sent to you from mlmmj; follow the included instructions to finish unsubscribing.
es: Se te enviará un mensaje de confirmación desde lmmj; sigue las instrucciones que se incluyen para finalizar el proceso de baja.

source: Should I ask `-questions` or `-hackers`?
es: ¿Debería preguntar en `-questions` o `-hackers`?

source: Two mailing lists handle general questions about FreeBSD, `FreeBSD-questions` and `FreeBSD-hackers`. In some cases, it is not really clear which group you should ask. The following criteria should help for 99% of all questions, however:
es: Dos listas de correo manejan las preguntas generales sobre FreeBSD, `FreeBSD-questions` y `FreeBSD-hackers`. En algunos casos, no está realmente claro a qué grupo debes preguntar. Sin embargo, los siguientes criterios deberían ayudar en el 99% de los casos:

source: If the question is of a general nature, ask `FreeBSD-questions`. Examples might be questions about installing FreeBSD or the use of a particular UNIX(R) utility.
es: Si se trata de una pregunta general, pregunta en `FreeBSD-questions`. Algunos ejemplos pueden ser preguntas acerca de la instalación de FreeBSD o el uso de una utilidad UNIX(R) en particular.

source: If you think the question relates to a bug, but you are not sure, or you do not know how to look for it, send the message to `FreeBSD-questions`.
es: Si crees que la pregunta está relacionada con un fallo, pero no estás seguro, o no sabes cómo buscarlo, envía el mensaje a `FreeBSD-questions`.

source: If the question relates to a bug, and you are _sure_ that it is a bug (for example, you can pinpoint the place in the code where it happens, and you maybe have a fix), then send the message to `FreeBSD-hackers`.
es: Si la pregunta está relacionada con un fallo y estás _seguro_ de que es un fallo (por ejemplo, puedes localizar el punto del código en el que sucede y quizás tienes un arreglo), entonces envía el mensaje a `FreeBSD-hackers`.

source: If the question relates to enhancements to FreeBSD, and you can make suggestions about how to implement them, then send the message to `FreeBSD-hackers`.
es: Si la pregunta está relacionada con mejoras en FreeBSD y puedes hacer sugerencias acerca de cómo implementarlas, envía el mensaje a `FreeBSD-hackers`.

source: There are also a number of other extref:{handbook}[specialized mailing lists, eresources-mail], which caters to more specific interests. The criteria above still apply, and it is in your interest to stick to them, since you are more likely to get good results that way.
es: También hay cierto número de extref:{handbook}[listas de correo especializadas], que se encargan de intereses más específicos. El criterio mostrado arriba todavía es aplicable y te interesa seguirlo ya que así tienes más posibilidades de obtener buenos resultados.

source: Before Submitting a Question
es: Antes de enviar una pregunta

source: You can (and should) do some things yourself before asking a question on one of the mailing lists:
es: Puedes (y debes) hacer algunas cosas tú mismo antes de hacer una pregunta en una de las listas de correo:

source: Try solving the problem on your own. If you post a question which shows that you have tried to solve the problem, your question will generally attract more positive attention from people reading it. Trying to solve the problem yourself will also enhance your understanding of FreeBSD, and will eventually let you use your knowledge to help others by answering questions posted to the mailing lists.
es: Intenta resolver el problema por su cuenta. Si publicas una pregunta que muestra que has intentado resolver el problema, tu pregunta generalmente atraerá una atención más positiva de las personas que la lean. Intentar resolver el problema tú mismo también mejorará tu comprensión de FreeBSD, y eventualmente te permitirá usar tu conocimiento para ayudar a otros respondiendo preguntas publicadas en las listas de correo.

source: Read the manual pages, and the FreeBSD documentation (either installed in [.filename]#/usr/doc# or accessible via WWW at http://www.FreeBSD.org[http://www.FreeBSD.org]), especially the extref:{handbook}[handbook] and the extref:{faq}[FAQ].
es: Lee las páginas del manual y la documentación de FreeBSD (instalada en [.filename]#/usr/doc# o accesible en http://www.FreeBSD.org[http://www.FreeBSD.org]), especialmente el extref:{handbook}[handbook] y el extref:{faq}[FAQ].

source: Browse and/or search the archives for the mailing list, to see if your question or a similar one has been asked (and possibly answered) on the list. You can browse and/or search the mailing list archives at https://www.FreeBSD.org/mail[https://www.FreeBSD.org/mail] and https://www.FreeBSD.org/search/#mailinglists[https://www.FreeBSD.org/search/#mailinglists] respectively. This can be done at other WWW sites as well, for example at http://marc.theaimsgroup.com[http://marc.theaimsgroup.com].
es: Busca y/o navega por los archivos de la lista de correo para ver si tu pregunta o una similar ha sido ya preguntada (y posiblemente respondida) en la lista. Puedes buscar y/o navegar los archivos de la lista en https://www.FreeBSD.org/mail[https://www.FreeBSD.org/mail] y https://www.FreeBSD.org/search/#mailinglists[https://www.FreeBSD.org/search/#mailinglists] respectivamente. También se puede hacer en otros sitios web, como por ejemplo http://marc.theaimsgroup.com[http://marc.theaimsgroup.com].

source: Use a search engine such as http://www.google.com[Google] or http://www.yahoo.com[Yahoo] to find answers to your question.
es: Utiliza un buscador como http://www.google.com[Google] o http://www.yahoo.com[Yahoo] para encontrar respuestas a tus preguntas.

source: How to Submit a Question
es: Cómo Enviar una Pregunta

source: When submitting a question to FreeBSD-questions, consider the following points:
es: Al enviar una pregunta a FreeBSD-questions, ten en cuenta los siguientes puntos:

source: Remember that nobody gets paid for answering a FreeBSD question. They do it of their own free will. You can influence this free will positively by submitting a well-formulated question supplying as much relevant information as possible. You can influence this free will negatively by submitting an incomplete, illegible, or rude question. It is perfectly possible to send a message to FreeBSD-questions and not get an answer even if you follow these rules. It is much more possible to not get an answer if you do not. In the rest of this document, we will look at how to get the most out of your question to FreeBSD-questions.
es: Recuerda que a nadie se le paga por responder una pregunta de FreeBSD. Lo hacen por su propia voluntad. Puedes influir positivamente en este libre albedrío enviando una pregunta bien formulada que proporcione tanta información relevante como sea posible. Puedes influir negativamente en este libre albedrío enviando una pregunta incompleta, ilegible o grosera. Es perfectamente posible enviar un mensaje a FreeBSD-questions y no obtener una respuesta incluso si sigue estas reglas. Es mucho más posible no obtener una respuesta si no la recibes. En el resto de este documento, veremos cómo aprovechar al máximo su pregunta sobre FreeBSD-questions.

source: Not everybody who answers FreeBSD questions reads every message: they look at the subject line and decide whether it interests them. Clearly, it is in your interest to specify a subject. "FreeBSD problem" or "Help" are not enough. If you provide no subject at all, many people will not bother reading it. If your subject is not specific enough, the people who can answer it may not read it.
es: No todos los que responden a las preguntas de FreeBSD leen todos los mensajes: miran la línea del asunto y deciden si les interesa. Obviamente, le interesa especificar un asunto. "Problema en FreeBSD" o "Ayuda" no son suficientes. Si no proporcionas ningún asunto, muchas personas no se molestarán ni en leerlo. Si su asunto no es lo suficientemente específico, las personas que puedan responderlo podrían no leerlo.

source: Format your message so that it is legible, and PLEASE DO NOT SHOUT!!!!!. We appreciate that a lot of people do not speak English as their first language, and we try to make allowances for that, but it is really painful to try to read a message written full of typos or without any line breaks.
es: Formatea tu mensaje para que sea legible, y POR FAVOR NO GRITES !!!!!. Apreciamos que mucha gente no hable inglés como su primer idioma, y tratamos de hacer concesiones por eso, pero es realmente doloroso intentar leer un mensaje escrito lleno de errores tipográficos o sin saltos de línea.

source: Do not underestimate the effect that a poorly formatted mail message has, not just on the FreeBSD-questions mailing list. Your mail message is all people see of you, and if it is poorly formatted, one line per paragraph, badly spelt, or full of errors, it will give people a poor impression of you.
es: No subestimes el efecto que tiene un mensaje de correo mal formateado, no solo en la lista de correo de preguntas de FreeBSD. Tu mensaje de correo es todo lo que la gente ve de ti, y si está mal formateado, una línea por párrafo, mal escrito o lleno de errores, le dará a la gente una mala impresión sobre ti.

source: A lot of badly formatted messages come from http://www.lemis.com/email.html[bad mailers or badly configured mailers]. The following mailers are known to send out badly formatted messages without you finding out about them:
es: Muchos mensajes mal formados vienen de http://www.lemis.com/email.html[malas aplicaciones de correo o mal configuradas]. Las siguientes aplicaciones de correo son conocidas por enviar mensajes mal formateados sin que te des cuenta:

source: Try not to use MIME: a lot of people use mailers which do not get on very well with MIME.
es: Intenta no utilizar MIME: mucha gente utiliza aplicaciones de correo que no se llevan muy bien con MIME.

source: Make sure your time and time zone are set correctly. This may seem a little silly, since your message still gets there, but many of the people you are trying to reach get several hundred messages a day. They frequently sort the incoming messages by subject and by date, and if your message does not come before the first answer, they may assume they missed it and not bother to look.
es: Asegúrate de que tu hora y zona horaria estén configuradas correctamente. Esto puede parecer un poco tonto, ya que tu mensaje todavía llega, pero muchas de las personas a las que está tratando de llegar reciben varios cientos de mensajes al día. Con frecuencia clasifican los mensajes entrantes por asunto y por fecha, y si tu mensaje no llega antes de la primera respuesta, es posible que asuman que se lo perdieron y no se molestan en mirar.

source: Do not include unrelated questions in the same message. Firstly, a long message tends to scare people off, and secondly, it is more difficult to get all the people who can answer all the questions to read the message.
es: No incluyas preguntas no relacionadas en el mismo mensaje. En primer lugar, un mensaje largo tiende a asustar a la gente y, en segundo lugar, es más difícil conseguir que todas las personas que pueden responder a todas las preguntas lean el mensaje.

source: Specify as much information as possible. This is a difficult area, and we need to expand on what information you need to submit, but here is a start:
es: Especifica la mayor cantidad de información posible. Esta es un área difícil y necesitamos ampliar la información que necesitas enviar, pero aquí hay un comienzo:

source: In nearly every case, it is important to know the version of FreeBSD you are running. This is particularly the case for FreeBSD-CURRENT, where you should also specify the date of the sources, though of course you should not be sending questions about -CURRENT to FreeBSD-questions.
es: En casi todos los casos, es importante conocer la versión de FreeBSD que estás ejecutando. Este es particularmente el caso de FreeBSD-CURRENT, donde también debe especificar la fecha de las fuentes, aunque por supuesto no debe enviar preguntas sobre -CURRENT a FreeBSD-questions.

source: With any problem which _could_ be hardware related, tell us about your hardware. In case of doubt, assume it is possible that it is hardware. What kind of CPU are you using? How fast? What motherboard? How much memory? What peripherals?
es: Con cualquier problema que _pueda_ estar relacionado con el hardware, infórmanos sobre tu hardware. En caso de duda, supongamos que es posible que sea el hardware. ¿Qué tipo de CPU estás utilizando? ¿Cómo de rápida? ¿Qué placa base? ¿Cuánta memoria? ¿Qué periféricos?

source: There is a judgement call here, of course, but the output of the man:dmesg[8] command can frequently be very useful, since it tells not just what hardware you are running, but what version of FreeBSD as well.
es: Hay una cuestión de conciencia aquí, por supuesto, pero la salida del comando man:dmesg[8] con frecuencia puede ser muy útil ya que dice no sólo el hardware que tienes sino también qué versión de FreeBSD.

source: If you get error messages, do not say "I get error messages", say (for example) "I get the error message 'No route to host'".
es: Si obtienes mensajes de error, no digas "Obtengo mensajes de error", di (por ejemplo) "Obtengo el mensaje de error 'No route to host'".

source: If your system panics, do not say "My system panicked", say (for example) "my system panicked with the message 'free vnode isn't'".
es: Si tu sistema entra en pánico, no digas "Mi sistema ha entrado en pánico", di (por ejemplo) "mi mensaje ha entrado en pánico con el mensaje 'free vnode isn't'".

source: If you have difficulty installing FreeBSD, please tell us what hardware you have. In particular, it is important to know the IRQs and I/O addresses of the boards installed in your machine.
es: Si tienes dificultades para instalar FreeBSD, díganos qué hardware tienes. En particular, es importante conocer las IRQ y las direcciones de E / S de las placas instaladas en tu máquina.

source: If you have difficulty getting PPP to run, describe the configuration. Which version of PPP do you use? What kind of authentication do you have? Do you have a static or dynamic IP address? What kind of messages do you get in the log file?
es: Si tienes dificultades para ejecutar PPP, describe la configuración. ¿Qué versión de PPP usas? ¿Qué tipo de autenticación tienes? ¿Tiene una dirección IP estática o dinámica? ¿Qué tipo de mensajes recibe en el archivo de registro?

source: A lot of the information you need to supply is the output of programs, such as man:dmesg[8], or console messages, which usually appear in [.filename]#/var/log/messages#. Do not try to copy this information by typing it in again; it is a real pain, and you are bound to make a mistake. To send log file contents, either make a copy of the file and use an editor to trim the information to what is relevant, or cut and paste into your message. For the output of programs like man:dmesg[8], redirect the output to a file and include that. For example,
es: Mucha de la información que tienes que proporcionar es la salida de algunos programas, como man:dmesg[8], o mensajes de consola que normalmente aparecen en [.filename]#/var/log/messages#. No intentes copiar esta información escribiéndola de nuevo; es un verdadero dolor y estás destinado a cometer un error. Para enviar el contenido de ficheros de log, haz una copia del fichero y utiliza un editor para dejar sólo la información relevante, o corta y pega en tu mensaje. Para la salida de programas como man:dmesg[8], redirecciona la salida a un fichero e inclúyelo. Por ejemplo,

source: This redirects the information to the file [.filename]#/tmp/dmesg.out#.
es: Esto redirige la información al fichero [.filename]#/tmp/dmesg.out#.

source: If you do all this, and you still do not get an answer, there could be other reasons. For example, the problem is so complicated that nobody knows the answer, or the person who does know the answer was offline. If you do not get an answer after, say, a week, it might help to re-send the message. If you do not get an answer to your second message, though, you are probably not going to get one from this forum. Resending the same message again and again will only make you unpopular.
es: Si hace todo esto y aún no obtienes una respuesta, podría haber otras razones. Por ejemplo, el problema es tan complicado que nadie sabe la respuesta, o la persona que sí sabe la respuesta estaba fuera de línea. Si no recibes una respuesta después de, digamos, una semana, podría ser útil volver a enviar el mensaje. Sin embargo, si no obtienes una respuesta a tu segundo mensaje, probablemente no obtendrás una de este foro. Reenviar el mismo mensaje una y otra vez solo te hará impopular.

source: To summarize, let's assume you know the answer to the following question (yes, it is the same one in each case). You choose which of these two questions you would be more prepared to answer:
es: En resumen, supongamos que conoces la respuesta a la siguiente pregunta (sí, es la misma en cada caso). Tú eliges cuál de estas dos preguntas estarías más preparado para responder:

source: Message 1
es: Mensaje 1

source: Subject: HELP!!?!?? I just can't get hits damn silly FereBSD system to workd, and Im really good at this tsuff, but I have never seen anythign sho difficult to install, it jst wont work whatever I try so why don't you guys tell me what I doing wrong.
es: Asunto: AYUDA!!?! ?? Simplemente no puedo conseguir golpes malditos y tontos del sistema FereBSD para funcionó, y soy muy bueno en este tsuff, pero nunca he visto cualquier cosa que sea difícil de instalar, no funcionará, haga lo que intente Entonces, ¿por qué no me dicen qué estoy haciendo mal?

source: Message 2
es: Mensaje 2

source: Subject: Problems installing FreeBSD
es: Subject: Problema instalando FreeBSD
